graph main_graph (
  %input[INT8, 1x96x96x1], exponents: [-7]
) initializers (
  %onnx::Conv_150[INT32, 24]
  %onnx::Conv_177[FLOAT, 32]
  %onnx::Conv_155[INT8, 3x3x144x1]
  %/layers/layers.1/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_162[INT32, 144]
  %/layers/layers.0/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_144[INT32, 96]
  %/layers/layers.1/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_141[INT32, 16]
  %classifier.2.weight[INT8, 1x1x32x8]
  %onnx::Conv_156[INT32, 144]
  %onnx::Conv_168[INT32, 32]
  %onnx::Conv_143[INT8, 1x1x16x96]
  %onnx::Conv_146[INT8, 3x3x96x1]
  %onnx::Conv_170[FLOAT, 192x32x1x1]
  %/layers/layers.3/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_153[INT32, 144]
  %onnx::Conv_149[INT8, 1x1x96x24]
  %onnx::Conv_167[INT8, 1x1x144x32]
  %/layers/layers.3/conv/conv.5/Constant_output_0[INT8, 1]
  %/first/first.2/Constant_output_0[INT8, 1]
  %/layers/layers.0/conv/conv.2/Constant_output_0[INT8, 1]
  %/first/first.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_171[FLOAT, 192]
  %onnx::Conv_140[INT8, 3x3x1x16]
  %onnx::Conv_152[INT8, 1x1x24x144]
  %/layers/layers.1/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_159[INT32, 24]
  %/layers/layers.2/conv/conv.2/Constant_1_output_0[INT8, 1]
  %/layers/layers.2/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_176[FLOAT, 32x192x1x1]
  %/layers/layers.3/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_173[FLOAT, 192x1x3x3]
  %classifier.2.bias[INT32, 8]
  %onnx::Conv_147[INT32, 96]
  %/layers/layers.0/conv/conv.2/Constant_1_output_0[INT8, 1]
  %/layers/layers.1/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_161[INT8, 1x1x24x144]
  %/layers/layers.2/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_165[INT32, 144]
  %/layers/layers.2/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_174[FLOAT, 192]
  %onnx::Conv_164[INT8, 3x3x144x1]
  %/layers/layers.3/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_158[INT8, 1x1x144x24]
  %/layers/layers.0/conv/conv.5/Constant_1_output_0[INT8, 1]
  %PPQ_Variable_1[FLOAT, 1]
  %PPQ_Variable_2[INT8, 1]
  %PPQ_Variable_4[FLOAT, 1]
  %PPQ_Variable_5[INT8, 1]
  %PPQ_Variable_7[FLOAT, 1]
  %PPQ_Variable_8[INT8, 1]
  %PPQ_Variable_10[FLOAT, 1]
  %PPQ_Variable_11[INT8, 1]
  %PPQ_Variable_13[FLOAT, 1]
  %PPQ_Variable_14[INT8, 1]
  %PPQ_Variable_16[FLOAT, 1]
  %PPQ_Variable_17[INT8, 1]
  %PPQ_Variable_19[FLOAT, 1]
  %PPQ_Variable_20[INT8, 1]
) {
  %/first/first.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%input, %onnx::Conv_140, %onnx::Conv_141)
  %/first/first.2/Clip_output_0 = Clip[quant_type = 'S8'](%/first/first.0/Conv_output_0, %/first/first.2/Constant_output_0, %/first/first.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/first/first.2/Clip_output_0, %onnx::Conv_143, %onnx::Conv_144)
  %/layers/layers.0/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.0/Conv_output_0, %/layers/layers.0/conv/conv.2/Constant_output_0, %/layers/layers.0/conv/conv.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 96, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.0/conv/conv.2/Clip_output_0, %onnx::Conv_146, %onnx::Conv_147)
  %/layers/layers.0/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.3/Conv_output_0, %/layers/layers.0/conv/conv.5/Constant_output_0, %/layers/layers.0/conv/conv.5/Constant_1_output_0)
  %/layers/layers.0/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.5/Clip_output_0, %onnx::Conv_149, %onnx::Conv_150)
  %/layers/layers.1/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.6/Conv_output_0, %onnx::Conv_152, %onnx::Conv_153)
  %PPQ_Variable_9 = RequantizeLinear[quant_type = 'F32'](%/layers/layers.0/conv/conv.6/Conv_output_0, %PPQ_Variable_10, %PPQ_Variable_11)
  %/layers/layers.1/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.0/Conv_output_0, %/layers/layers.1/conv/conv.2/Constant_output_0, %/layers/layers.1/conv/conv.2/Constant_1_output_0)
  %/layers/layers.1/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.2/Clip_output_0, %onnx::Conv_155, %onnx::Conv_156)
  %/layers/layers.1/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.3/Conv_output_0, %/layers/layers.1/conv/conv.5/Constant_output_0, %/layers/layers.1/conv/conv.5/Constant_1_output_0)
  %/layers/layers.1/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.5/Clip_output_0, %onnx::Conv_158, %onnx::Conv_159)
  %/layers/layers.1/Add_output_0 = Add[quant_type = 'S8'](%PPQ_Variable_9, %/layers/layers.1/conv/conv.6/Conv_output_0)
  %/layers/layers.2/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/Add_output_0, %onnx::Conv_161, %onnx::Conv_162)
  %/layers/layers.2/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.0/Conv_output_0, %/layers/layers.2/conv/conv.2/Constant_output_0, %/layers/layers.2/conv/conv.2/Constant_1_output_0)
  %/layers/layers.2/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.2/conv/conv.2/Clip_output_0, %onnx::Conv_164, %onnx::Conv_165)
  %/layers/layers.2/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.3/Conv_output_0, %/layers/layers.2/conv/conv.5/Constant_output_0, %/layers/layers.2/conv/conv.5/Constant_1_output_0)
  %/layers/layers.2/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.2/conv/conv.5/Clip_output_0, %onnx::Conv_167, %onnx::Conv_168)
  %PPQ_Variable_12 = DequantizeLinear[quant_type = 'F32'](%/layers/layers.2/conv/conv.6/Conv_output_0, %PPQ_Variable_13, %PPQ_Variable_14)
  %/layers/layers.3/conv/conv.0/Conv_output_0 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'F32', strides = [1, 1]](%PPQ_Variable_12, %onnx::Conv_170, %onnx::Conv_171)
  %PPQ_Variable_0 = QuantizeLinear[quant_type = 'F32'](%/layers/layers.3/conv/conv.0/Conv_output_0, %PPQ_Variable_1, %PPQ_Variable_2)
  %/layers/layers.3/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%PPQ_Variable_0, %/layers/layers.3/conv/conv.2/Constant_output_0, %/layers/layers.3/conv/conv.2/Constant_1_output_0)
  %PPQ_Variable_15 = DequantizeLinear[quant_type = 'F32'](%/layers/layers.3/conv/conv.2/Clip_output_0, %PPQ_Variable_16, %PPQ_Variable_17)
  %/layers/layers.3/conv/conv.3/Conv_output_0 = Conv[dilations = [1, 1], group = 192, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'F32', strides = [1, 1]](%PPQ_Variable_15, %onnx::Conv_173, %onnx::Conv_174)
  %PPQ_Variable_3 = QuantizeLinear[quant_type = 'F32'](%/layers/layers.3/conv/conv.3/Conv_output_0, %PPQ_Variable_4, %PPQ_Variable_5)
  %/layers/layers.3/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%PPQ_Variable_3, %/layers/layers.3/conv/conv.5/Constant_output_0, %/layers/layers.3/conv/conv.5/Constant_1_output_0)
  %PPQ_Variable_18 = DequantizeLinear[quant_type = 'F32'](%/layers/layers.3/conv/conv.5/Clip_output_0, %PPQ_Variable_19, %PPQ_Variable_20)
  %/layers/layers.3/conv/conv.6/Conv_output_0 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'F32', strides = [1, 1]](%PPQ_Variable_18, %onnx::Conv_176, %onnx::Conv_177)
  %PPQ_Variable_6 = QuantizeLinear[quant_type = 'F32'](%/layers/layers.3/conv/conv.6/Conv_output_0, %PPQ_Variable_7, %PPQ_Variable_8)
  %/layers/layers.3/Add_output_0 = Add[quant_type = 'S8'](%/layers/layers.2/conv/conv.6/Conv_output_0, %PPQ_Variable_6)
  %/classifier/classifier.0/GlobalAveragePool_output_0 = GlobalAveragePool[quant_type = 'S8'](%/layers/layers.3/Add_output_0)
  %PPQ_Variable_21 = Transpose[perm = [0, 3, 1, 2], quant_type = 'S8'](%/classifier/classifier.0/GlobalAveragePool_output_0)
  %/classifier/classifier.1/Flatten_output_0 = Flatten[axis = 1, quant_type = 'S8'](%PPQ_Variable_21)
  %output = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/classifier/classifier.1/Flatten_output_0, %classifier.2.weight, %classifier.2.bias)
  return %output
}


initializers value:
%onnx::Conv_150, shape: [24], exponents: [-13], docString: layout ==> UNK, 
value: array([  343, -1033, -2257, -3469,  2649,  1025,  -578, -1584,  1359,
       -5801, -1235, -7809,  3792, -4765,  1516,  2303,  2701,  3221,
        3654,  1273,  2866,  1790, -4024,   554], dtype=int32)
%onnx::Conv_177, shape: [32], exponents: [0], docString: layout ==> UNK, 
value: array([ 0.7886185 , -0.30985633,  0.36495167,  0.5354005 ,  0.19852175,
        0.13555633, -0.15107839,  0.205966  ,  2.092231  ,  0.260078  ,
        0.7237098 ,  0.45425555,  0.28342855, -0.22803576,  0.6873116 ,
       -0.49463776,  0.9406953 , -0.31854716,  0.6370542 , -1.0182697 ,
       -1.0645915 , -0.96313846,  1.2548277 ,  1.6108652 ,  0.24764487,
       -0.08173101, -0.22249979, -0.23880894, -0.6304996 , -0.68906343,
       -1.072189  , -0.26362243], dtype=float32)
%onnx::Conv_155, shape: [3, 3, 144, 1], exponents: [-4], docString: layout ==> N16HWC16, 
value: array([ -11,   -7,   -2,    5,   -8,    0,  -13,  -11,  -17,   -4,  -12,
         -3,    9,  -38,    3,   -8,   10,    8,    5,    7,   -5,   -7,
         -6,  -12,    8,  -14,    8,   -9,    3,  -11,  -12,   -3,    4,
         11,    5,    1,    9,  -12,   -9,  -12,    3,   -4,   -3,    7,
          0,   -3,    5,   -4,   -3,   -4,    6,   -1,    1,   -9,   -1,
         -4,    1,   -4,    3,   15,   -4,   -6,  -28,  -14,    1,   -3,
          2,    1,   -2,   -3,   -4,   -2,  -23,  -14,    4,    9,    3,
          4,    4,    0,    9,    6,    5,    4,   -5,   -6,    3,   -7,
          2,   -8,    8,    4,    8,    6,   12,    0,   -5,  -18,   -2,
          1,   11,    0,    5,   -4,   24,    4,   10,    6,   -5,   -4,
         16,  -10,  -10,   -8,   11,    2,  -11,   -1,    4,   -8,   -7,
          2,    3,  -14,    4,   -2,   11,    0,   10,   19,   18,    4,
         15,   -3,   11,   -6,   16,   -7,   -1,  -15,   18,   -6,  -13,
         -1,    8,   -1,    7,   -3,   -3,    1,   -5,  -11,   10,    5,
          2,    2,  -11,    3,   -2,   -3,    1,   -5,    4,   -4,    1,
         -3,    7,   -9,    2,   -7,   10,    3,   -5,   -6,  -21,    5,
         -7,  -10,    0,   17,   -6,    1,    4,   -7,   -3,   -5,   13,
          5,  -21,    0,    3,   -3,    4,   -5,    2,   19,   -3,  -14,
          4,  -10,    0,   -8,   11,   -1,    0,   -5,   -4,  -16,    5,
          2,    0,   -3,   -7,   -4,   -2,   -2,   -3,  -11,    1,   -2,
          4,    2,   -2,   20,  -10,   -1,   -9,   21,   -2,   -1,   -1,
          6,   -9,   -5,    7,    5,    3,    4,    3,    4,  -14,  -11,
          5,    0,  -11,    3,    4,   -6,    2,    1,    6,    1,   -3,
         -2,  -21,  -11,   -2,   -1,    4,    6,   -3,    2,    3,  -11,
         -8,   -4,    5,    3,    7,   10,    5,   -3,   -4,   12,  -19,
         -3,   -4,   -5,    8,    4,   -5,   20,    7,    7,   10,    9,
        -16,   -6,    9,   -8,    3,    7,  -20,   17,   -9,   11,    7,
         -8,   -5,   -6,    9,  -11,    8,   -6,    0,   -1,   -6,    7,
         -4,   19,  -10,    5,   11,    1,    0,    9,    9,    2,   -5,
          0,    3,  -12,   -7,    5,    7,  -11,  -12,   12,   -6,   -6,
          2,   13,   37,    0,  -10,   -9,   13,   -5,   11,    8,  -23,
          1,   -1,    4,    2,   -5,  -18,    8,   -8,  -20,   -6,   -4,
         -5,    3,   -2,    6,  -20,    9,    5,    2,   -9,    6,   17,
          3,   -5,  -10,   13,   -3,   -6,   -4,    5,   -1,  -10,    9,
         -2,    3,    1,    2,   14,   27,   23,    8,   -4,    1,    5,
         -3,    8,    3,    0,    3,   18,   -7,   10,   -4,   -2,   17,
          4,  -16,   -1,    4,    0,    0,    7,   -1,   -7,    5,    8,
          4,   -7,   -3,    1,   -2,  -11,    2,   13,   11,   -6,   -2,
          7,    4,    4,   -5,   -6,    2,  -18,   -6,   24,   15,   19,
         -2,    3,   17,   -8,    8,    6,    7,    0,  -14,  -10,  -55,
          0,   10,   14,   76,   -3,   -7,   -5,    0,   12,   -7,    1,
          7,    2,    1,  -10,    4,    1,    6,  -18,    4,    4,    2,
         11,   -3,    4,  -10,   10,  -12,    9,  -14,  -16,   12,    1,
        -17,   32,   -3,   -4,    5,    1,    0,  -42,  -11,    3,   13,
         -4,   -1,    7,   -2,  -24,    0,  -18,    7,  -11,   -4,  -16,
         -5,    0,    7,    4,   -4,    5,   -4,    0,    4,   -1,   -7,
          4,    9,   -3,   -1,    7,   -2,   17,   -7,   -3,   -3,    3,
        -17,    0,  -38,   -8,   -5,   -1,  -26,    6,    5,   11,   -8,
         -6,   -6,   10,    9,  -13,    8,    1,    0,  -14,    8,   12,
         -9,  -13,  -10,    8,    1,    7,    2,   27,    4,   -8,  -10,
          5,   -9,  -10,    2,  -13,   -8,   -3,   -8,  -11,   -4,   28,
          3,    1,   -4,   -8,   -6,    7,  -23,   -6,  -16,    1,  -23,
          2,    2,  -19,   -2,    2,   12,   -5,   -7,   -3,    1,   -9,
          7,   -2,   -5,    5,    8,   12,   -7,   24,   -4,    2,   12,
         -8,   -5,   -5,   -2,  -15,    5,   15,    2,    9,    4,    1,
         10,  -21,   -6,   -2,    4,   -8,    5,   -7,   20,  -22,    9,
          2,   -9,    1,   24,   -7,   27,   -6,   -8,    4,   -7,    0,
        -12,   -5,   -2,   15,   -1,    2,   12,    3,  -38,    4,   -5,
         -9,    3,    0,   10,   -4,   -2,   -1,   -4,   12,    7,  -22,
        -13,   -2,    2,   -1,  -13,    5,   -2,    0,  -10,   -9,    6,
         -2,    2,    3,    3,  -11,   -4,   11,  -12,  -10,   14,    6,
          2,    1,   -4,    9,   -6,   -4,  -19,   -1,   -1,    0,    6,
         -2,   -8,    0,  -31,   30,    8,    6,  -19,  -14,    4,    1,
          3,   -5,    1,    9,   16,   -2,  -18,  -14,  -23,   27,   -6,
          7,   -8,   -9,    1,   -1,  -10,   12,  -13,   -4,   10,   -6,
        -37,   -5,   -6,   14,  -10,   22,   13,  -18,   -4,    4,    5,
         -3,    0,   -6,   -3,    2,  -36,    8,    7,  -32,    7,   -2,
         21,   13,   -5,    2,    3,    8,   -9,  -13,    4,    6,   24,
          7,    6,   40,    9,   34,  -19,   15,   -4,   -7,   12,    5,
          2,   -9,    7,    3,   27,   -5,    9,   49,  -10,  -60,   22,
         -2,   -2,    7,   -6,   -1,    1,    0,    0,    4,  -31,    4,
         -7,   20,    2,  -20,   29,   -2,    1,   -2,    2,    5,   -1,
        -21,   -1,    4,    0,   -5,   -2,   12,   10,   47,   28,    1,
          0,   -6,    2,    6,    0,   -8,    5,    3,    8,   -2,    5,
        -14,   -4,  -18,  -28,  -13,   -4,    5,   17,  -13,    6,    6,
          5,    4,  -11,    4,   -5,    9,  -13,  -19,    8,   -8,   -6,
         -1,    9,   -6,   11,   -4,    8,    3,   11,    5,    3,  -28,
         -2,   -8,    0,    0,   -9,  -12,   13,    6,  -20,   -5,   17,
          2,   18,    3,   12,   -4,    7,   -8,   -2,   -3,    4,   -4,
         -4,   10,   -1,   -8,    6,   10,  -13,  -11,  -69,   -9,  -14,
        -12,    2,    2,   -3,   -3,   -4,   10,    0,    6,   -3,   10,
          6,    7,   -4,   -2,   -9,    7,  -12,    0,    2,  -14,    9,
          5,   -3,    2,    6,   -5,   10,    7,   23,    4,   -5,   -3,
          6,   -8,    5,    8,   -2,    7,   -5,   -5,    6,    8,   31,
          3,   18,   -8,  -14,   -5,    4,   -7,    2,   -3,    9,   -9,
          3,    6,    0,   -2,  -28,  -16,   19,    0,  -26,   12,   11,
        -10,    5,   -4,    1,  -13,   -5,   16,    7,   -1,   -4,   -6,
         12,    3,  -22,   -1,   -1,   -1,    5,    8,   -4,   18,  -11,
         -3,    0,    4,   15,   -5,  -34,   -2,    5,  -12,   -8,    0,
          9,    6,   10,    6,    2,   -7,    0,    4,    9,  -27,   40,
          3,  -27,  -21,   14,    8,    0,    2,   -5,  -16,   -4,   -4,
         -1,   -5,  -14,  -15,    2,   15,   -8,    5,    7,    2,   17,
         14,   -6,    5,   30,    4,   13,   -7,    8,   -6,    4,   -7,
         -4,    2,    4,    5,  -13,    3,    1,   -6,    1,    6,   -2,
          3,  -16,   -9,    2,   -4,   -5,    3,   12,   12,   -9,    6,
         26,  -12,   32,    3,    8,    3,   -3,  -12,    9,   -6,   -7,
         10,   -1,    3,   13,  -17,  -22,    3,   -6,    2,    2,  -10,
         -7,    0,    0,   -8,   -9,   10,    1,    2,   -8,   13,  -11,
         -9,  -47,    0,   -2,   -5,   20,    2,    0,  -11,   -9,   10,
         -6,    2,   27,   21,    8,   -6,   11,    4,   -6,  -12,  -12,
         -1,   -5,   -4,   -1,   11,  -11,   -1,   11,   15,   -4,   14,
         12,    0,    0,  -24,    0,    4,  -15,   -9,   -4,   22,   -3,
          1,   11,   22,    4,   10,  -29,    2,    1,   -9,   -3,    2,
         -6,    2,   -8,    6,   -7,   -2,    6,   11,   -5,    1,  -27,
         -1,  -16,  -10,    1,   -7,   -4,   -2,   -5,   12,   10,   -8,
          7,   -4,   -3,   13,  -13,   28,   36,   -2,    8,    4,   -6,
         17,   -4,  -16,    2,   -4,  -18,   -2,   -6,    7,    0, -103,
         20,    6,    9,   22,    2,   19,   -4,   -3,   -7,    0,   -5,
         -4,  -15,    4,  -11,   15,   34,    0,   17,   15,   -8,   -3,
          5,    4,    2,    0,   18,   -3,    7,   16,    6,   30,   -5,
          9,    0,   -7,   -2,   -4,   -4,   -7,   10,   -4,    6,   13,
         -9,    9,    5,  -30,  -11,    5,    2,   17,    7,   14,   -5,
         -6,   -7,   -2,  -44,   -9,    2,   -5,   15,  -30,  -10,   -7,
         -3,   13,   -1,    0,   -8,   -5,  -23,    1,   33,   -4,   -1,
         18,   10,  -19,   19,    7,   -9,   -6,    4,  -12,   -1,  -17,
         -6,   -6,   -2,    4,   -3,   11,   15,   61,  -14,    2,   -8,
         11,   13,  -11,   -1,   -1,    6,    3,   -5,   -8,   12,   -9,
        -14,   14,    6,   -1,  -13,   19,    2,   -7,    3], dtype=int8)
%/layers/layers.1/conv/conv.5/Constant_output_0, shape: [1], exponents: [-4], docString: layout ==> UNK, value: [0]
%onnx::Conv_162, shape: [144], exponents: [-10], docString: layout ==> UNK, 
value: array([ -32,  -86,  -71, -125,  -79,   96,   58,   -2,   59,  -33,  -90,
        -44,  -16,  -10,   28,    1,  -14,   17,  -48, -198,    1,  -16,
       -213,   -1,   10, -112,   14, -104, -201,  -45,  -44,  -71, -153,
        -42,  -75,  -37,  -15,  -55,   -9, -283, -141,  -12,  -99,  -85,
        -88,    3,   29,  -16,  -79,    1,   -7,    5,   44,   81,   11,
        -48,  -30,  -41, -120,   25, -217,  -43, -150,   19,   90,  -31,
         -4,  -14,  -40,  -74,  -90,   14,   29,  -60,  -99, -110,    6,
        -81, -152,  -25,   20,    4,  -37,  -88,   28,   38,   70,  -88,
        -10,   45,  -47,   -2, -126, -100,  -38, -115,   82,   86, -106,
       -107, -179,   19,   31,  -72,  -46,  -19,  -90,  -31,  -50,    6,
       -157,  -57,  -92,  -33, -119,   15,  -86,   84,   -2, -190,  -30,
         22, -142,  -14, -287,  -79,  -82,   -4, -124,   36,  -17, -140,
        -66,   53,  -30,   -6,    9,  -39,  -38,   -5, -165,  -38,   46,
        -45], dtype=int32)
%/layers/layers.0/conv/conv.5/Constant_output_0, shape: [1], exponents: [-5], docString: layout ==> UNK, value: [0]
%onnx::Conv_144, shape: [96], exponents: [-9], docString: layout ==> UNK, 
value: array([ -524,   200,   -85,   -77,  -230,   162,   617,    18,  -310,
         153,   891,  -414, -1110,  -592,   194,   175,  -174,   258,
        -733,   375,  -100,   156,   755,    64,   213, -1205,   -13,
         284,  -272,   125,  -296,  -287,  -543,  -383,   165,  -576,
        1163,  -565,   266,   173,    48,   169,  -127,   215,   779,
         249,  -280,   409,   409,   400,  -263,   616,   -16,   591,
          -7,  -343,   138,  -256,   183,   221,  -423,  -507,   449,
        -175,   133,   -15,  -248,    81,    30,    57,   413,  -242,
        -475,   828,   286,  -790,   -95,   173,  -249,    14,  -471,
        -242,   221,   -74,  -661,    93,   -35,    -1,   447,    20,
          34,    16,   -79,   415,  -537,   120], dtype=int32)
%/layers/layers.1/conv/conv.2/Constant_output_0, shape: [1], exponents: [-4], docString: layout ==> UNK, value: [0]
%onnx::Conv_141, shape: [16], exponents: [-11], docString: layout ==> UNK, 
value: array([-935,  742, -847, -864, 1080,  842,  472, -872, -508,  799, -907,
        925,  838, -955,  956, -975], dtype=int32)
%classifier.2.weight, shape: [1, 1, 32, 8], exponents: [-7], docString: layout ==> N16HWC16_UNALIGNED, 
value: array([  47,   61,   28, -106,   -9,  -86,   89,   29,  -40,   24,   30,
        -84,   33,  -50,   47,   22,  -12,  -66,   26,  -27,   -1,  -99,
        -27,   -4,  -68,   23,   59,  -55,   14,   90,   24,   24,   26,
        -29,    2,   85,  -56,    5,  -65,   19,   35,  -64, -103,   28,
         68,  -31,   12,  -84,  -20,   55,   72,   24,   -8,   94,  -24,
         55,  -36,   84,   26, -105,   59,   32,    3,  -33,    8,  112,
         47,    6,   81,  -11,   23,  -22,   59,   60,   43,  -77,  -54,
         -8,   74,  -25,    7,  -70,  -23,  -16,   17,  -12,   75,   10,
        105,   55,  -62,   70,  -36,  -37,   83,  -59,  -33,  -30,   20,
        -47,   17,   91,  -15,   90,   53,  -97,   15,   39,    6,  -98,
          9,   84,  -37,  -92,  -20,    5, -103,  -26,   47,   37,   56,
        -39,   85,   39,   55,  -28,   54,  -37,   94,  -14,    7,  115,
         -1,  -46,  -52,  -58,   57,   -2,  -13,   -7,  -88,   96,   46,
        -32,   74,    5,   32,  -64,    1,   32,   22,   23,  -94,  -21,
        -57,   16,  -57,  -73,  -22,    4,   15,   -7,  -70,  -12,  -67,
        -48,  -62,   66,  -41,  -24,  -78,  -64,   58,   16,   86,   13,
        103,   66,  -25,   56,   82,   18,  -42, -116,  -50,  -43,   85,
         32,   83,  -11,   13,   39,  -96,  -10,  -20,  -63,   63,   40,
         10,  -64,  -70,    1,   44,   -7,  -42,   65,  -88,   -5,    8,
        -10,  -90,   36,  103,   88,   13,  -82,   40,  -26,   63,   66,
        -30,  -54,   67,   -7,  -32,  -45,  -43,   16,  -72,   -4,  -61,
         41,   23,   90,   84,   17,    5,   34,  -41,  109,    8,   18,
        -53,   61,   73,   77,   39,   15,   33,  -38,  -62,  -33,  -29,
         76,  -69,   73], dtype=int8)
%onnx::Conv_156, shape: [144], exponents: [-8], docString: layout ==> UNK, 
value: array([ -20,  -17, -142, -102,  -23,  201,   61,  354,  -17,  252, -114,
         -4, -175,  251,  -10,  189,   74,   55,   14, -265,  180,  101,
       -103,  213,   65,   50, -307, -101,   47,  -46,  227,   50,  -42,
        133, -114, -102,  340, -231,   18, -135,   41,  119, -153, -143,
       -332,  170,  -40,  -63,  -95,   65, -286,  -61,   77,  263,   21,
        538,  275,   25,  -60,  -99,   71,   50,   31,   97, -106,   34,
        269,   62,  142,   69,    5,  -68,   53,  -52, -100,  406,   85,
        131, -331,  118,   70, -401,   43,  144,   18, -221,  -37,   53,
        295, -194, -166,  -54,  -91, -132, -207,  -29,  161,  -97,   84,
        -96,   -1,  -39,  -57,  110,  -34,  -70,  -60,  -43,  237,  -38,
        -13,  623, -372,   11,  -83, -146, -462,   38,   -3,  115, -104,
        -18,  315,   52,   84,   42,  210,  219,  151,   55,   94,   99,
         55,   68, -171,  -49,  230, -370,  -63,    3, -412,  -81,  -74,
         76], dtype=int32)
%onnx::Conv_168, shape: [32], exponents: [-11], docString: layout ==> UNK, 
value: array([  710,   817,   851, -1408,  -225, -1190,  3574,   588,  1003,
        -994, -1066,   294,   143,   257,   510,  -313,  -581, -1464,
        -920,  1106,    82, -1786,  1125,   204,  1494,  -379,   666,
         298,  -141,  -110,  -138,  -880], dtype=int32)
%onnx::Conv_143, shape: [1, 1, 16, 96], exponents: [-5], docString: layout ==> N16HWC16, 
value: array([ 19, -25,   2, -12,  -6,   2,   5,  16,   9, -26, -30,  27,  27,
        46,  26,  -9,  36,  -4,  -4,   5,   8,   0,   8,  10,   9, -38,
       -28,  -5,   4,  33, -42,  -7,  -4, -15,   8, -13,  17,  -5, -52,
         9,  18, -21,  26, -32,  -8, -15,  14,   0, -26,  25,   5,  12,
        15,  11, -17,  18,   1, -15,  -4,   5,  -8,  33, -30,  17, -14,
         5,  -2,  22,   7,  -1,  -3,  -5,  -2, -13, -93,  25,  33,  10,
       -13,   8,   8,   0,  -7,  -8, -12,  -5, -32,  45,  11,   6, -31,
        23,  36, -18,  13,   6,  15,  27,   3,  -8,  58,  -2,   4, -39,
       -10,  -8, -26,  33,  28,  -2, -56, -15,  15,  -2,   6,  -5,   7,
       -10,  17, -33,   9,  -3,   6,  27,  25, -39, -49,  12,   6,   6,
         5,  -1,  10,  -8,  42,  -8,  18,  59,  31,  19,  14,  -2,  20,
        -9,   6,  -5,   6,  -7,   0,   6,  -9,   7,  17,   0,  -5,  -1,
        46,  26, -16,  10,  35, -30,   3,  28, -23,  -9,   6,   3,  -7,
        32, -31, -14, -10,  25,  -4,  -9,  31, -32,  -4,  -2,   8,   1,
       -29, -39,  13,  41, -51,  -9,  20,  20,  37, -14,  14, -19,  -1,
         1, -21,  -8, -24,  14,  -2,   2,   1, -31,  -7,  27,  -8,   4,
       -25,  -7,   1,  -9,  -9,   6,  -7,   6,   0,  -8,  34,   1,  12,
       -50,   6, -17,  -3,   8,  -3, -21,   6,  12, -37, -19,  -9, -44,
        48,  18,  24,  36,   4,  -1,  17,  23,   5,  34,  -9, -22,  -7,
        16,  -4,   8, -27,   1,  -8,   1,  42, -11, -21,  -8,  -1,  -2,
        17,  -1,  28, -12,  -4,   0,   9, -27,   4, -18,   4,   2, -20,
         0,  39,   7,  -3,   9,  -9,  -4,  -2,  15,  -1, -19,  -3,   7,
       -10,   1, -32,  12,  29, -17,  16,  -9, -20, -17,  -3,  -5,   4,
         9,   9,  -4,  13, -21,   0, -29,  10,  16,  -5,  -6, -35, -13,
        -7,  32,   7,  23,   3,  -6,  25,  -9, -10,  -5, -29, -28, -10,
         0, -41,   3,   1,  66,   0, -19,   9,   2,   1,  20,  28, -11,
        19, -11, -19,   0, -28,   6,  -3,  23,  -7,   5,   3,   1,   4,
         4,   3, -20,  69,   7,  -2,  -4,  16,   0,  -3, -15,  -9,   7,
         5,   2,  -8,   9,  -2,   8, -23, -31,  -9, -10,   2,   4,  -8,
       -11,   0,   7,  11,   1, -15,  -4,  44,  -7, -17,  23,  16,  -7,
        12,  -3,   4,  17,   0,  10,   5,   9, -17,   7, -26,   1,  13,
       -35,  13,  -4,  19,  -1,  -5,  28,  -5, -36,   3,  -9,  20,  13,
        16, -21,   9,  11,   7,  -1, -21,  -1,  -7, -39,   4, -16,  -9,
        -1,  -9,   4,  -7,  12,  16,  -9,   4,  -3, -63,   6,  -1,  37,
        -9,   9,   2,  -1,   5,  20,  44,   0,  -4,  12,  29,   3, -41,
         8,   1,  15,   5,  31,   1,   0,  -3,   2,  19,  -4,  43, -23,
       -20,   2,  18,  -1,  -2,  56,   5,  -7,   9,   1,  28,  -6,  17,
        -9,  49,  -2, -11,   3,  -2,   3,   5,  29,  -7,  -8,  -5,   3,
        10,  14, -17,  13, -36,   3,  19,  -5,  19,   6,  -5,   2,   7,
       -30,   7, -14,  -1,   1,   7,  10,  -6, -17, -10,  32,  -4, -16,
        -8,  11,  -5,   9,   0,  -6,  -7, -28,   0,   8,   6,  16,   2,
       -24,   3,   0,   1,  -5,  -3,   2, -11,  -7,   6, -32, -12,   6,
         0,   9, -12, -23,  11,   1,   2,   2,  -7,  -8,  -5,  -7, -20,
       -40,  -5,   4,   0,  -9, -27,  -9,  19,   5,  13,   8,  -6, -12,
       -12, -11,  30, -29,   7,   5,   0,  20, -54,  70, -20,   4,   8,
         8,  -2,   4,  -4, -10,  12, -39,  25,   4,   9,   5,  -1,  -7,
       -11,  -2,   5, -15,   1, -13, -27,   9, -30,  -4,   4,   8,   3,
         7, -32,  30,  -5,   0,  10,  -8,  -3,  -6,  14,   5,  22,   3,
         4,  -6,  -8, -10,   1,  -4,  -2, -11,   2,   1,   6,  -4, -32,
        -9,  31, -50,  -1,  -6,   4,  14, -19,  -7,  22,  -6,  -3,  -5,
         4,  -3,  18,  -8,  12,  -1,  18,   4,   2,   5, -43,  46,  -6,
         2,  -6, -21,   9,  -6, -30,   0,  -2,  38,  22,  13,   1,   7,
        30,  12,  -5,  -1, -10, -16,  17,  -5,   2,   2, -12,  80,  19,
        -3,  -4,  15, -37, -26,   3,   6,  -8,  -7,  -1,  15, -15,  -7,
        20,  13,  -9,  10,  -7,   6, -72,  49,   6,   5,   8,   2, -11,
        -3, -30,  -4,   4, -21,  13,  12, -13,  13,  38,  10, -17, -10,
       -15,  20,  11,  -8,  19,   2,   2,  65,   4,   5,  -1,  -2,  20,
        -4, -43, -12,   8, -25,   8,  -6, -49,   5, -12, -25,  11,   1,
        -7,  37, -53, -35,  12,   1, -11,   7,  14,  -8, -10,  -1,  -1,
        -6,   7,  -8,   5,  22,  -1, -47,  -2, -11,  -1,  10,  -1,  -4,
       -50,  -2, -47,  15,  28,  -5,  -1, -29,  -8, -33,  -9,  11,  -4,
         0,  -4,  -4,   7,  18, -44,  -7,   2, -10,  -5,  -7,  17,  13,
        21,   3,  -7,  -2, -10,  -2,  52,  15,  15,   1, -30, -18,  11,
       -21,   3, -25,  -5,   9,  -4,   8,  -7,   6,  29,   5,   8,   5,
        11,  -6,  11,  24, -20,  42,  20,   0,   3,   7,  -4,  -3,  21,
        11, -19,  10, -19,  -8,  -5,  -6,  -6, -60,  26,  10,  -1, -14,
         2,  -8, -38,  -4, -17,   3,  13,  -3, -18,   4,  -5,   4, -26,
         6,   1,   4,   2,   7,  28,   6,  -5,   8,   4,  -2,  14,  44,
         4,  45, -40,   3,  -5,  16,  -2,  -9,  29,  15, -50,  -3,  22,
         2,   2, -39,  -8, -27,  24,   8,  -8,  18,  -2,  -9, -38,  10,
        -5,   5, -13,  -6,   7,  -9, -10, -44,  -6, -13,   1,   3,   2,
        -6, -11, -11,  -2,  -2, -34, -19,   0, -15,   7,   1,  20,  13,
         5,  -2,  -1,   0,  20, -18,  37,  -1, -80,  -8,  11, -13,  29,
       -21,  34,  -1,   3,  -2,   1,  12,  18,   6,  -6,  -8, -22,  -6,
        -4, -23, -16,   6,  -7,  15,   2,  15,  -5, -16,  -5,  13,  11,
        -9,   8,  -6,   8, -34,  -1,  -4, -40,  32,  -9,   1,  -3,  -6,
       -43,   4,   2,   8,  19,  -8,   5, -61,   4, -25, -16,   9,   1,
         2,   4,   6,  46,  23,  20,  -1,  -7,  19,   3,   9,  10,   9,
         3, -17,  -9,  -9, -11, -13,   3,  16,   4,   2,   4, -18,   6,
        -1, -24,  -2, -28,   3,  29, -14,   0, -24,   7, -25,  14, -20,
         0,  30, -17, -15,  17, -27,  22, -40,  72,  -8,  -2,   5,  -3,
        28,  -7,  -1,   2, -32,   6,  -5,  10,  66,  14, -11,  43,  12,
        -3,  22,   8,   3, -22,  21,   5, -12,  -1, -14,   4,  32, -33,
        -6, -55,   9, -13,  20,  -1, -21,   6,  -5,  -3,  -9,   2,  17,
        -5,  -2,  -5,  11,  27, -36,   1,  37,  -1, -15,  24,   7, -10,
       -35,  -8,  -4,  -7, -32, -55,  29,  -4, -17,  -4,  42,   0, -22,
       -11,   7,  22,  -4,  -4,   6,  -6, -23,   3,  -5,  -9, -16,  -4,
        -5,   3,  37,   4,   1,   6,  -5,   2, -11, -15, -65,  -1,  -5,
        83, -39,   7,  18,   0,   3, -12, -19,  -1,  -2,  10,   7,   0,
        48,  31,  12,   7,  -6,  -3,  15,  -8,  36, -24,   9, -10, -22,
        -5,   1,   0,   9,   6,   3, -43, -23,   4,  13,  17,   7,   5,
         0,   9,  23,   3,   3, -16, -70,  21,  30, -10, -23,   1,   7,
        21,   9,  22,  -7, -12,  34,  11,  -8,  -3, -11, -20,  12,  31,
        -4,  11,   8, -14,   5,  -4,  -3,  -5,  55,   9,  -2,  19,  53,
        -4,  -8, -13, -36,  -4,  32,   4, -53, -11,   5,  -7,  -3,   5,
        -2,   6, -13,  17,  15, -33,  -7, -23, -20,   6,  -5,   2, -18,
       -31,  -2,  24,  12,  16,   5, -22,   6,  14,  -2, -19, -24, -10,
       -10,  14,  12,   9,  17,   8, -10,   4,  24, -31,   1, -44,  26,
        -2,  15,   0,   4,  40,  12,  35,  11,  16,  13,  19,  -5,  18,
       -21,   8,  30,  12, -10,   0,   2,  24,  -5,  44,  -4, -19, -19,
       -24,  -6,  -9, -48, -20, -60, -21,  10,   8,   3,  63,  -9,  33,
         9, -13,  11, -12,  -5,   7, -12,  -3,  15, -23,   9,  19,  -8,
        -3,  -6, -31,   4, -27,   5,   3,   9,  25,  -1,  -9, -23,  22,
        -3,  13,  -5, -42, -11,  11,   4,   1,  -3,  32,   5,   4,  13,
       -10,  35,  -1,  -3,  -2,  -5,  -2,  10,  28,   5,  -6, -13,   9,
        -2,  -6,  -3,  -9,  29,  18,   2,   3, -13, -16,  -9, -11,   2,
       -31,  18, -38,   7, -15,  44,  -2,  61, -63,   4,   8, -36,  -6,
         2, -53,   3,  28,  -8, -40,  -7, -12,  19, -13,  17,   3,  -8,
        -1,   3, -25,   4, -33,   1, -12,   2,  55,  -1,   6, -12,  -6,
       -66,  -1,  12,   4, -14,   7,   2,  38,   9,   6,   2,   1,   8,
        16,   4,   3,  30,  18,   2,  -6, -12,  38,  -3,   8,  -7,  14,
        -1,   6, -13,  -8,  15,  -6,   4,  -2, -14,  -1,   6,  13,   3,
         3,   5,   2,   7,   0,  -9, -15,   5,  12, -37,  -3,  21,   0,
       -14,  -8, -12,  12,  -2,  18,   4,  73,   7,  -5,   2, -10, -91,
       -13,  -7,  -3,  11,  -6,   6,  17,  -1, -15,   0,  24, -11,   2,
         3,  -7, -13,  -7, -12,   7, -11,  22,   5,   5,  -5,  -1,  -9,
        34,   8,  -2,  -1, -13,  16,  25,  -1, -16, -36,  33,  20,   2,
        18, -12,  11, -15,   1,  -4, -21,  -3,  28,   5,  -3,  -3,  36,
        41, -25], dtype=int8)
%onnx::Conv_146, shape: [3, 3, 96, 1], exponents: [-4], docString: layout ==> N16HWC16, 
value: array([ -13,    7,    0,    1,  -10,   41,    1,   -4,   14,   12,   -4,
          1,    2,    0,   -6,   31,   -7,    0,    5,    3,  -12,  -32,
         -3,   -3,   10,   -3,   13,    2,    6,   -2,    8,   39,   16,
         -1,    1,   -2,  -13,  -39,    0,    1,   10,   -6,  -14,    7,
          3,    5,    7,   -9,    6,    7,    7,   -1,    3,   21,   -4,
         -5,    6,   -5,    2,    2,   -1,    7,    3,   29,    5,    6,
          5,  -10,    8,   45,   -9,   -5,    4,   -2,  -16,    3,    0,
          1,    5,  -13,   -1,  -30,   -3,   -5,   10,  -92,    7,    0,
          0,    7,    6,   -1,    3,   12,    7,  -47,   -2,   -5,    4,
         -9,   16,   57,   -7,   -2,   -8,  -16,    2,   -1,    5,    9,
          0,   11,   -4,   -2,    1,    7,   13,   18,   -4,    0,  -19,
          8,   -2,    1,    2,   14,    1,    0,  -12,   -1,   -4,   -1,
          9,  -55,    5,   -5,  -17,   12,   -4,    7,    7,    8,    0,
        -27,    1,  -37,    5,    4,    7,  -18,    7,   -4,  -22,  -12,
          9,   -7,  -17,  -31,   -8,   -8,   -3,  -16,    0,    8,   -1,
         35,    8,   -9,  -26,   14,  -14,   21,  -15,  -13,   -6,    6,
        -19,   -3,   -9,    2,    0,   82,   -1,   -6,   13,   17,    1,
         28,    3,    2,  -19,    1,    1,  -39,  -14,    4,    8,   24,
          7,  -20,  -15,  -12,    9,   -7,   -3,  -53,   -5,  -31,    7,
        -19,    7,   11,   -3,  -39,    3,  -42,  -40,   -3,  -14,    1,
          6,    3,    7,   -6,   -8,  -18,   14,   12,    2,   17,   -8,
         10,  -11,   10,    4,    4,    3,  -33,   11,    5,    8,   12,
         -5,   -4,    5,   11,    4,  -15,   -8,    2,    5,   11,    7,
         -2,   -2,   -9,    7,  -12,    7,    5,    0,  -34,   -1,  -43,
         -5,  -12,  -12,   10,   13,   -7,   -3,  -20,    5,  -34,    9,
          9,   -1,   38,   -5,    2,  -27,  -13,   -2,   12,   11,   -7,
          5,  -20,   -1,   10,   32,  -12,    4,  -11,   -1,   -9,    1,
          1,    0,    3,    5,   33,    3,    0,    1,    7,   27,   -6,
          8,   -3,   -1,   -4,   20,    2,   -1,   17,  -11,    4,    1,
          0,    1,    9,  -18,    4,    4,    0,    9,  -11,   22,   -1,
          0,   35,   -1,    2,    1,    9,    2,   18,   10,   -6,    5,
         -4,    2,   -4,    9,    0,    5,   23,   -1,    8,   -4,    5,
          4,   -2,  -13,   -2,    4,   -5,    4,  -48,   11,    6,    1,
        -16,   -6,   11,    2,    6,    5,   -4,  -40,   10,    0,   -4,
          2,  -40,   30,    6,    6,   -3,   -7,   -5,    5,    4,   -1,
        -17,  -25,    2,    8,   -5,   -1,  -19,   -7,    1,   -4,   41,
         -2,   29,    4,    4,    3,   -8,  -84,    8,    3,  -17,    7,
          6,    4,    3,    8,   21,    1,    4,    7,    6,    7,    7,
         -4,   13,    2,   -8,   -4,  -25,   41,    1,    3,   19,   -4,
         44,    1,   -5,   -1,    2,   -1,    0,   -8,   -1,   -6,    4,
        -42,    7,   29,   48,    2,    4,   -6,   10,    2,   30,   -2,
         -3,   -8,    3,   74,   -2,   26,    0,  -21,   -6,    7,  -11,
        -13,   -7,    3,   27,    1,   -5,   -6,   11,    2,    1,   55,
         -4,   23,  -36,    2,  -12,    4,   -5,   -2,  -12,   -2,   -8,
          0,    5,   46,   -2,    0,    8,   -5,  -15,    3,   -2,  -29,
         -3,    8,   12,   -6,    3,   -3,    5,  -11,   -3,   93,    6,
         20, -125,    7,   -7,   -3,   -7,    2,   40,    3,  -11,    2,
         11,  -10,    1,   13,   -8,   22,   30,    6,  -10,    0,   26,
         13,  -28,   -3,   -3,   19,   -1,   28,   -6,  -70,    5,  -15,
        -18,    7,    0,  -24,   -9,    7,   22,   -1,   -5,   14,    7,
        -64,   -7,   36,    0,   26,   21,    6,    8,   -2,   -1,   12,
         11,   -9,  -14,    1,    9,  -10,   -4,  -20,    1,   67,  -11,
          4,   15,  -17,   14,   -3,    0,    4,    2,    5,    0,   -6,
         12,   -1,  -12,   20,    7,   11,   -2,    2,   -4,    2,  -11,
         10,  -45,  -39,    3,    3,    9,   -7,   -7,    1,   -1,   -3,
          3,    3,  -14,    2,   -4,    7,  -11,  -27,    3,   -4,   -9,
         -1,  -43,  -13,   -3,   -1,    2,   -8,    2,    5,   22,   -8,
        -10,    4,    5,  -11,   10,    7,   18,    3,    6,    9,   -3,
          3,  -32,    4,   10,    4,  -12,  -33,    8,  -10,   -2,   -2,
         22,   -3,    0,   -3,    8,    1,  -34,   -1,    8,    5,  -12,
          4,    3,   17,  -16,  -11,   17,  -36,    2,    1,    7,   -2,
          8,    5,   27,   -7,  -30,  -12,    2,   -3,    6,   17,   39,
        -28,    4,    4,    0,    8,  -34,    7,   17,   -6,  -22,   -8,
          5,    4,   -9,    8,  -17,  -39,    4,    3,    5,    7,  -24,
          0,   11,    8,   12,    0,    3,   -5,    2,   -7,    1,  -35,
          4,   -4,    5,    4,    9,   -3,   10,   -2,  -15,    0,   10,
         11,   12,   33,    3,   28,  -46,  -15,    2,   16,   19,   -2,
         -8,   -7,   -4,    8,   -2,   12,    4,   53,    3,   17,   -3,
          5,   -8,    6,   -9,   -8,    3,  -20,    7,    2,   -8,    3,
         -8,  -69,    0,   -1,   27,    0,   -7,    5,   38,   -2,   -5,
        -11,   -5,   11,   17,   -7,    7,   57,    5,   19,  -52,   11,
         -5,   -5,   28,   -1,   -8,  -16,    7,   13,   29,  -12,   11,
         -9,    3,    2,   -6,    2,    0,   -7,   13,  -10,   -4,  -14,
         10,   -1,   24,   -5,    4,   12,    2,   -5,    6,   -3,   -4,
         -3,   22,  -10,   -6,  -17,  -11,    2,   15,   -2,   12,    2,
          5,   -5,    1,   29,   -7,  -15,    6,  -13,    0,  -14,   -1,
         -4,   35,  -14,   11,   -8,    5,   -7,   -2,   -6,    2,   -9,
         18,  -11,   -2,  -22,    5,   -8,   18,   -3,    8,  -33,    3,
         -2,   -1,  -17,    3,    5,   15], dtype=int8)
%onnx::Conv_170, shape: [192, 32, 1, 1], exponents: [0], docString: layout ==> UNK, 
value: array([-1.03158064e-01, -1.11329816e-02, -8.07257444e-02, -1.73173860e-01,
       -1.55968130e-01,  2.09057406e-01, -3.18284035e-02,  2.22897112e-01,
        6.11887686e-02, -1.43196806e-01,  2.46843353e-01,  2.39884868e-01,
       -8.24079216e-02, -1.05841465e-01,  2.47737486e-02,  2.78482229e-01,
       -9.14045945e-02,  1.13689467e-01,  3.24589103e-01, -7.23598599e-02,
        9.54793580e-03,  1.38969526e-01, -1.36850700e-01, -5.67627663e-04,
       -1.51598779e-02,  2.65106857e-01, -9.54731405e-02,  3.22162807e-01,
        4.55791540e-02,  6.06575422e-02, -6.87408969e-02, -2.31940001e-02,
       -2.13067695e-01, -1.17453828e-01, -8.30812678e-02,  1.83656737e-01,
       -1.55546904e-01,  1.09479137e-01,  4.68515344e-02,  1.05326340e-01,
        1.99411642e-02,  1.13049798e-01, -1.47947326e-01,  2.02269834e-02,
        7.69096091e-02, -9.70241725e-02, -7.32699186e-02,  6.87360689e-02,
        2.40802597e-02, -2.05490440e-02, -1.21175982e-01,  5.11016846e-02,
       -4.83815372e-03,  1.26521096e-01, -1.75539628e-01,  1.46980673e-01,
        9.93748475e-03,  4.69176508e-02,  4.05985266e-02,  4.96964343e-02,
        1.20295487e-01, -8.48875940e-02, -9.50321928e-02, -1.07247266e-03,
        6.31365329e-02, -3.62053841e-01,  1.31969498e-02, -1.04602734e-02,
       -4.39309299e-01, -1.52985811e-01, -1.15422346e-01, -5.90424379e-03,
       -9.04834550e-03,  1.54059336e-01,  2.94876516e-01,  6.25661165e-02,
        6.63678646e-02, -2.09746018e-01, -9.39788371e-02,  4.34244387e-02,
       -2.38812834e-01,  8.81127566e-02,  1.20720193e-01, -2.28211761e-01,
       -1.82944596e-01, -8.67901295e-02,  2.53825098e-01, -2.32246034e-02,
       -8.27651024e-02, -2.60803532e-02,  2.34979838e-01,  6.21990934e-02,
       -1.39215797e-01,  3.01892698e-01,  4.23291093e-03, -1.13042563e-01,
       -1.73046738e-01,  7.26934290e-03, -1.28879637e-01, -2.70539492e-01,
       -3.41761969e-02,  7.76286945e-02, -1.37918219e-02,  3.52687351e-02,
       -9.87127498e-02, -3.66718322e-02, -1.23451494e-01, -5.77775529e-03,
        2.76091648e-03,  7.86519647e-02, -2.31473178e-01,  1.51398033e-01,
       -1.15665160e-01, -2.21237503e-02,  2.68620159e-02, -2.12639555e-01,
        9.75092724e-02,  1.29810765e-01, -1.20558366e-01, -2.68945634e-01,
       -4.09681723e-02, -2.18860880e-01, -1.16380602e-01,  1.30409360e-01,
        2.29283512e-01, -2.39965811e-01,  1.83048565e-02, -7.79289678e-02,
       -1.28270909e-01,  2.35369653e-01, -2.49636427e-01, -1.96207594e-02,
        3.50306630e-02,  3.87429334e-02, -1.58607796e-01,  2.33545601e-01,
        1.52069703e-01, -8.17902677e-04,  7.29039358e-03, -1.09881282e-01,
        7.15098456e-02, -5.82997687e-02, -1.42871439e-01, -1.29155383e-01,
        1.43636853e-01, -1.20222777e-01,  1.80169623e-02,  1.87140599e-01,
       -5.22195399e-02,  2.51244187e-01,  1.05529591e-01, -2.32901379e-01,
        1.58867300e-01,  9.18935761e-02,  1.82784852e-02, -2.07116399e-02,
        1.08065031e-01, -1.14272825e-01,  1.08060203e-01,  2.17255011e-01,
       -5.35126142e-02,  1.63855534e-02, -6.18902966e-02,  1.63273502e-03,
        1.58191323e-01,  2.07601003e-02,  2.69984757e-03, -1.83180586e-01,
       -6.29465729e-02, -5.19399270e-02,  2.10687116e-01, -1.82140663e-01,
       -1.08113565e-01, -1.42913297e-01,  7.58269522e-03, -1.33915797e-01,
       -4.76040542e-02,  1.07541353e-01,  7.17064142e-02, -1.70703575e-01,
       -1.56680465e-01, -2.26751957e-02,  2.47503504e-01,  2.12361608e-02,
        8.11754465e-02, -6.55334368e-02, -1.46169230e-01,  7.10288296e-03,
       -1.06490128e-01, -3.16331498e-02, -7.44959265e-02,  4.27364297e-02,
        5.09385876e-02, -1.34289414e-01, -1.77362397e-01, -5.16456813e-02,
        1.66235641e-01, -1.13634393e-01,  1.32100374e-01, -1.13546103e-01,
        5.20171411e-02,  2.13240907e-02,  2.08721280e-01, -8.71065184e-02,
        3.03398997e-01, -3.35795134e-02,  2.20249947e-02, -2.08123773e-02,
        1.35245919e-01,  5.90077899e-02,  4.43663076e-02, -3.51127237e-01,
        7.72381872e-02, -1.38117433e-01,  1.88709095e-01, -2.07276195e-01,
       -5.65394983e-02,  2.62936831e-01, -8.69479105e-02, -6.01811521e-02,
       -8.53614956e-02,  1.02118917e-01,  7.33136684e-02, -3.80169749e-02,
        1.73928291e-01,  2.26929635e-01,  9.29783657e-03,  6.71387762e-02,
       -2.21864786e-03,  9.44952816e-02, -3.73927429e-02,  3.62729430e-02,
        1.69838861e-01,  3.27077866e-01,  4.37227935e-01, -4.62799072e-02,
        4.52371947e-02, -1.88377440e-01, -2.70745740e-03, -7.49397203e-02,
        7.15139881e-02,  1.20038494e-01,  2.30746418e-01, -9.76588428e-02,
       -1.03791364e-01,  6.97242245e-02,  2.86993176e-01, -7.97837041e-03,
        4.47387062e-02, -5.43110110e-02, -1.34385884e-01, -1.68634042e-01,
        5.57641909e-02, -1.25372291e-01,  4.81415726e-02,  1.38123289e-01,
        6.21674210e-03,  1.29183792e-02, -3.61802205e-02, -8.24535415e-02,
        2.38862827e-01, -3.10902208e-01, -3.15021947e-02, -3.91822517e-01,
        7.36965388e-02, -1.57727107e-01, -1.25212535e-01,  8.06963518e-02,
       -9.91920568e-03, -5.73464371e-02,  3.36559862e-01,  2.05366418e-01,
       -2.05853730e-01,  2.39290655e-01, -2.85821743e-02, -1.18988149e-01,
       -3.65379788e-02,  2.27843061e-01, -5.46491221e-02, -1.15039170e-01,
        4.80513042e-03,  5.76438978e-02,  7.12695196e-02, -8.17676261e-02,
        1.37528926e-01,  1.37582496e-01, -1.51580172e-02, -7.06172064e-02,
        2.11950541e-02, -1.25367016e-01,  1.90554127e-01, -6.67017996e-02,
       -1.46848839e-02,  1.92177489e-01, -1.54770032e-01,  9.86853912e-02,
       -1.05247840e-01,  2.57862508e-01, -3.85937355e-02, -7.71669671e-03,
        3.68063375e-02,  5.42115904e-02,  4.96525355e-02, -6.77065402e-02,
        1.00765213e-01, -3.48249935e-02, -1.00495353e-01, -1.93782512e-03,
        6.34386167e-02, -4.52663191e-03, -4.47981246e-02, -2.28135623e-02,
       -2.74549305e-01,  8.15132819e-03, -1.00771464e-01,  5.81950434e-02,
        1.93840519e-01,  2.70660575e-02,  4.38380428e-02,  1.61881074e-02,
       -1.63940355e-01, -1.17940843e-01, -1.26188219e-01, -1.30444705e-01,
       -4.73703854e-02, -5.80140352e-02, -7.47245774e-02, -3.79145667e-02,
        3.15594912e-01, -3.45601350e-01,  1.87072411e-01, -3.36416699e-02,
        2.66895257e-02,  1.31769925e-01,  2.15605404e-02,  2.10616767e-01,
       -5.07170931e-02, -1.52839765e-01,  1.49528474e-01, -5.35841025e-02,
       -3.11136872e-01, -2.19877332e-01, -3.04435641e-02, -1.00407019e-01,
       -1.01995669e-01,  1.65631389e-03,  5.35479970e-02, -6.92441836e-02,
       -9.65397432e-02,  3.44785787e-02,  6.91830590e-02,  6.48362786e-02,
        5.70257418e-02, -4.53999732e-03, -2.00256541e-01, -2.53419608e-01,
        3.52689102e-02,  4.26284503e-03, -6.44427761e-02, -1.90282811e-03,
       -1.74666364e-02, -8.42444673e-02,  2.64731217e-02, -9.34990421e-02,
        7.83333927e-02, -8.88186023e-02,  5.82122430e-02,  2.40445465e-01,
        5.22478074e-02, -5.44497259e-02,  1.60910740e-01, -3.69213447e-02,
        5.80434129e-02, -1.91828720e-02,  1.29404634e-01,  1.61460131e-01,
        2.01129332e-01,  3.71891558e-02,  2.98351627e-02, -1.27348021e-01,
        1.25519549e-02,  3.30201358e-01,  2.55640388e-01, -6.08917363e-02,
        9.93555561e-02, -2.32861131e-01,  7.02293366e-02, -1.06541954e-01,
        2.88706869e-01,  9.97352898e-02, -1.80921897e-01,  4.20436040e-02,
       -1.72997802e-01, -8.54116529e-02,  2.35098168e-01,  8.59116092e-02,
        3.26580465e-01, -3.38453427e-02, -5.16889393e-02,  6.11306950e-02,
        2.30521724e-01, -2.63547152e-01, -7.15947757e-03,  1.12381130e-01,
        8.15713853e-02, -1.00055642e-01, -1.20774157e-01, -1.56068904e-02,
        3.92954856e-01,  1.43294111e-01,  1.84416041e-01, -2.41273232e-02,
        6.18774295e-02,  1.78437904e-01,  3.57497513e-01, -6.72788098e-02,
       -1.41339540e-01,  8.48562941e-02, -1.12709776e-01,  2.41704389e-01,
       -2.17513032e-02,  1.49449289e-01, -2.01708019e-01,  7.93473944e-02,
        1.11940883e-01,  4.41975519e-02,  4.88145128e-02, -2.15635207e-02,
        3.51750366e-02, -9.41531640e-03, -1.86297983e-01,  1.14870645e-01,
        4.05953377e-01,  1.28437892e-01,  2.98111439e-01,  2.27294698e-01,
        1.34193838e-01,  1.28733933e-01,  3.47298026e-01,  8.90452191e-02,
        2.15986043e-01,  2.47271985e-01,  3.09413159e-03, -1.11157507e-01,
        4.64405082e-02, -6.37579337e-02,  1.56793013e-01, -8.52905288e-02,
       -1.50106689e-02,  1.07830234e-01,  4.53733765e-02, -6.45531714e-03,
        3.07952669e-02,  2.04505205e-01, -4.37110439e-02, -2.56117787e-02,
       -1.43598050e-01,  2.76078820e-01,  9.02162939e-02, -3.46064009e-02,
        1.55272439e-01,  5.27340267e-03, -4.02797163e-02, -9.53380093e-02,
        4.07775640e-02, -6.40482381e-02,  1.54020876e-01, -1.21341601e-01,
        2.10880607e-01, -1.78566948e-01,  5.98642416e-02,  2.23451734e-01,
       -1.30799443e-01, -1.69511244e-01, -1.94839388e-02,  1.55128790e-02,
       -7.49275088e-02,  6.43794462e-02, -2.00090613e-02, -4.34692465e-02,
       -3.38249118e-03,  1.00145139e-01,  1.30514935e-01, -4.37066928e-02,
       -7.63779283e-02, -6.80468753e-02, -1.87083885e-01, -3.95919569e-03,
        1.99900419e-02,  1.11920163e-01, -5.24629094e-02,  1.44264251e-01,
        9.41422433e-02, -1.25534579e-01, -8.46137255e-02, -5.37703931e-02,
        5.51735386e-02, -1.43814966e-01, -3.09192631e-02,  3.57231870e-02,
        5.52139208e-02,  7.28992000e-03, -5.52281290e-02,  6.38094917e-02,
       -3.39252383e-01, -1.31703978e-02, -3.41838002e-02,  1.82555113e-02,
       -1.36102840e-01,  1.06188230e-01,  7.12328181e-02,  8.54445919e-02,
       -6.47573844e-02,  2.57861819e-02,  2.16258448e-02,  1.38062863e-02,
        3.36134940e-01, -2.79290527e-01,  3.78370658e-02,  1.69239685e-01,
       -1.40535540e-03,  4.85400371e-02,  1.33148894e-01, -7.06237778e-02,
       -4.88979742e-03, -9.88398911e-04,  3.09670009e-02,  1.61043271e-01,
       -2.01300249e-01, -4.56119850e-02,  2.62627065e-01, -3.58894825e-01,
       -4.60722558e-02,  6.10210858e-02,  2.68041603e-02, -4.40785140e-02,
        8.58962238e-02, -1.12250343e-01, -1.85299248e-01,  4.94204536e-02,
        8.18912536e-02, -5.03597371e-02,  1.77096814e-01,  9.35143791e-03,
       -9.86123830e-02, -5.72457947e-02,  1.24388389e-01,  4.08254042e-02,
       -1.82663605e-01, -1.32437065e-01,  3.52885053e-02,  1.86502233e-01,
        2.08978698e-01, -1.88539222e-01, -1.13324486e-01,  1.37034982e-01,
       -7.07479641e-02, -7.60345487e-03,  2.36820221e-01, -2.17013378e-02,
       -1.38995219e-02,  7.08258599e-02,  2.14379549e-01,  4.14445661e-02,
       -1.55828536e-01, -5.85012883e-02,  1.80410475e-01, -5.85466996e-02,
        1.39836753e-02,  1.61758184e-01,  7.96766300e-03,  1.82440996e-01,
        2.58288771e-01, -1.99042000e-02, -1.43393621e-01,  5.42219639e-01,
       -1.57395899e-02, -1.57454029e-01,  5.86195737e-02,  1.19690940e-01,
