graph main_graph (
  %input[INT8, 1x96x96x1], exponents: [-7]
) initializers (
  %/layers/layers.1/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_171[INT32, 192]
  %/layers/layers.3/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_174[INT32, 192]
  %onnx::Conv_176[INT8, 1x1x192x32]
  %/layers/layers.0/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_149[INT8, 1x1x96x24]
  %onnx::Conv_162[INT32, 144]
  %onnx::Conv_165[INT32, 144]
  %onnx::Conv_150[INT32, 24]
  %onnx::Conv_159[INT32, 24]
  %/layers/layers.3/conv/conv.2/Constant_1_output_0[INT8, 1]
  %/layers/layers.2/conv/conv.5/Constant_output_0[INT8, 1]
  %/layers/layers.1/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_143[INT8, 1x1x16x96]
  %onnx::Conv_146[INT8, 3x3x96x1]
  %onnx::Conv_164[INT8, 3x3x144x1]
  %/layers/layers.0/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_141[INT32, 16]
  %onnx::Conv_147[INT32, 96]
  %/layers/layers.2/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_158[INT8, 1x1x144x24]
  %onnx::Conv_144[INT32, 96]
  %/layers/layers.1/conv/conv.5/Constant_output_0[INT8, 1]
  %/layers/layers.1/conv/conv.5/Constant_1_output_0[INT8, 1]
  %/layers/layers.0/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_168[INT32, 32]
  %/layers/layers.0/conv/conv.5/Constant_1_output_0[INT8, 1]
  %classifier.2.weight[INT8, 1x1x32x8]
  %/layers/layers.3/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_140[INT8, 3x3x1x16]
  %onnx::Conv_161[INT8, 1x1x24x144]
  %/layers/layers.3/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_155[INT8, 3x3x144x1]
  %onnx::Conv_170[INT8, 1x1x32x192]
  %onnx::Conv_173[INT8, 3x3x192x1]
  %onnx::Conv_153[INT32, 144]
  %/first/first.2/Constant_1_output_0[INT8, 1]
  %/first/first.2/Constant_output_0[INT8, 1]
  %onnx::Conv_156[INT32, 144]
  %onnx::Conv_152[INT8, 1x1x24x144]
  %/layers/layers.2/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_177[INT32, 32]
  %/layers/layers.2/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_167[INT8, 1x1x144x32]
  %classifier.2.bias[INT32, 8]
  %PPQ_Variable_1[FLOAT, 1]
  %PPQ_Variable_2[INT8, 1]
) {
  %/first/first.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%input, %onnx::Conv_140, %onnx::Conv_141)
  %/first/first.2/Clip_output_0 = Clip[quant_type = 'S8'](%/first/first.0/Conv_output_0, %/first/first.2/Constant_output_0, %/first/first.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/first/first.2/Clip_output_0, %onnx::Conv_143, %onnx::Conv_144)
  %/layers/layers.0/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.0/Conv_output_0, %/layers/layers.0/conv/conv.2/Constant_output_0, %/layers/layers.0/conv/conv.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 96, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.0/conv/conv.2/Clip_output_0, %onnx::Conv_146, %onnx::Conv_147)
  %/layers/layers.0/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.3/Conv_output_0, %/layers/layers.0/conv/conv.5/Constant_output_0, %/layers/layers.0/conv/conv.5/Constant_1_output_0)
  %/layers/layers.0/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.5/Clip_output_0, %onnx::Conv_149, %onnx::Conv_150)
  %/layers/layers.1/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.6/Conv_output_0, %onnx::Conv_152, %onnx::Conv_153)
  %/layers/layers.1/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.0/Conv_output_0, %/layers/layers.1/conv/conv.2/Constant_output_0, %/layers/layers.1/conv/conv.2/Constant_1_output_0)
  %/layers/layers.1/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.2/Clip_output_0, %onnx::Conv_155, %onnx::Conv_156)
  %/layers/layers.1/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.3/Conv_output_0, %/layers/layers.1/conv/conv.5/Constant_output_0, %/layers/layers.1/conv/conv.5/Constant_1_output_0)
  %/layers/layers.1/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.5/Clip_output_0, %onnx::Conv_158, %onnx::Conv_159)
  %/layers/layers.1/Add_output_0 = Add[quant_type = 'S8'](%/layers/layers.0/conv/conv.6/Conv_output_0, %/layers/layers.1/conv/conv.6/Conv_output_0)
  %/layers/layers.2/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/Add_output_0, %onnx::Conv_161, %onnx::Conv_162)
  %/layers/layers.2/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.0/Conv_output_0, %/layers/layers.2/conv/conv.2/Constant_output_0, %/layers/layers.2/conv/conv.2/Constant_1_output_0)
  %/layers/layers.2/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.2/conv/conv.2/Clip_output_0, %onnx::Conv_164, %onnx::Conv_165)
  %/layers/layers.2/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.3/Conv_output_0, %/layers/layers.2/conv/conv.5/Constant_output_0, %/layers/layers.2/conv/conv.5/Constant_1_output_0)
  %/layers/layers.2/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.2/conv/conv.5/Clip_output_0, %onnx::Conv_167, %onnx::Conv_168)
  %/layers/layers.3/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.2/conv/conv.6/Conv_output_0, %onnx::Conv_170, %onnx::Conv_171)
  %PPQ_Variable_0 = RequantizeLinear[quant_type = 'F32'](%/layers/layers.2/conv/conv.6/Conv_output_0, %PPQ_Variable_1, %PPQ_Variable_2)
  %/layers/layers.3/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.3/conv/conv.0/Conv_output_0, %/layers/layers.3/conv/conv.2/Constant_output_0, %/layers/layers.3/conv/conv.2/Constant_1_output_0)
  %/layers/layers.3/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 192, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [1, 1]](%/layers/layers.3/conv/conv.2/Clip_output_0, %onnx::Conv_173, %onnx::Conv_174)
  %/layers/layers.3/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.3/conv/conv.3/Conv_output_0, %/layers/layers.3/conv/conv.5/Constant_output_0, %/layers/layers.3/conv/conv.5/Constant_1_output_0)
  %/layers/layers.3/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.3/conv/conv.5/Clip_output_0, %onnx::Conv_176, %onnx::Conv_177)
  %/layers/layers.3/Add_output_0 = Add[quant_type = 'S8'](%PPQ_Variable_0, %/layers/layers.3/conv/conv.6/Conv_output_0)
  %/classifier/classifier.0/GlobalAveragePool_output_0 = GlobalAveragePool[quant_type = 'S8'](%/layers/layers.3/Add_output_0)
  %PPQ_Variable_3 = Transpose[perm = [0, 3, 1, 2], quant_type = 'S8'](%/classifier/classifier.0/GlobalAveragePool_output_0)
  %/classifier/classifier.1/Flatten_output_0 = Flatten[axis = 1, quant_type = 'S8'](%PPQ_Variable_3)
  %output = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/classifier/classifier.1/Flatten_output_0, %classifier.2.weight, %classifier.2.bias)
  return %output
}


initializers value:
%/layers/layers.1/conv/conv.2/Constant_output_0, shape: [1], exponents: [-4], docString: layout ==> UNK, value: [0]
%onnx::Conv_171, shape: [192], exponents: [-11], docString: layout ==> UNK, 
value: array([-145,  -85,  -65, -247,   64,    5,  -71, -305,  -98, -320,   17,
        -95, -257,   10, -617, -140,   15,  -46, -108,  -84,  -16, -113,
       -221, -115, -278,  -81, -210,  -68,  -78,   65,  -46, -413, -235,
        -40,  107,  -85, -135, -384,  -84, -146, -167,    9,  -26,   27,
       -287,  -70, -180,   10, -383,  -17, -201,  -20, -146,   71, -213,
       -130,   74, -459, -382,  170, -464,   45, -153,  -31,  -51, -128,
       -550,  -11,   14, -131,   32, -102,  -10,  127,  162, -166,  -13,
        -69,  -94, -227, -149, -640,  -21, -485, -295, -151, -130, -203,
        -96,  -30,   16,  -57,   64,   -8,  137,  -64,   55, -640,  126,
       -109, -442, -234,  -53, -561, -139, -263, -109,  -19,   12, -169,
       -140, -566, -108, -157,  -66,   -4,  -76, -185,   45,    0,  -17,
        332,    7, -206, -148,  -94,   18,  -57,  -81,   -7, -236,   27,
        130, -334,  -13, -627,  -52,  -18,   57,  -25, -281, -152,   77,
        -96,  -94, -157,   91,   -8, -254,  -58, -102,  -31,   26,    8,
       -168,  -35, -509, -119,  -10,   -4,  -77,  -64,  -53, -104,  230,
         89,  -60,  -20,   92,   -3,  113,   67,   65, -202, -132, -156,
       -406,  108, -121,  -54,  -99,  -79,  -66,  -24, -295,   25,  -70,
         22,  -44,  -58, -154,   22], dtype=int32)
%/layers/layers.3/conv/conv.2/Constant_output_0, shape: [1], exponents: [-4], docString: layout ==> UNK, value: [0]
%onnx::Conv_174, shape: [192], exponents: [-9], docString: layout ==> UNK, 
value: array([  83,  185,  356, -266,  203,  261, -202, -233,  113, -365,  112,
         73, -327,  -73, -313,  184, -160, -288,  274, -275,  111,  252,
       -257, -296, -296,  137,  274,   74,  197,  738, -120, -328, -269,
        -91,  388, -508, -224, -304,  219,   62, -466,  343,  293,  283,
       -259,  348, -238, -260, -274,  158, -309,  134,   68,  405, -304,
       -253, -647, -293, -236,  486, -289,  327,  268,  353,  326, -241,
       -289, -470,  258, -200,  283,  305,  259,  492,  473,  208,  311,
        215, -345,   88,  294, -347,  281, -328, -263,  102, -251, -382,
        250,  265,  501,  192,  180,  320, -405, -231,  239, -274,  689,
         26, -306, -413,  272, -265, -108, -492, -255,  322,  390, -195,
       -355, -247,  142,  196,  285,  294,  298, -280, -670,  280,  421,
       1006,  237, -314,  239,  161,  286,   94,  267, -253, -184,  112,
       -473, -513,  332, -290,  180,  339, -287, -236, -355,  -61,  204,
        291,  -74, -190,  409, -259,  263,  364, -145,  125, -259,  176,
       -207,  339, -300, -529,  272,  184, -331,  132,  131,  321, -279,
        382,  185, -326, -413,  218,  119, -571, -395,  317,   93,  -33,
       -395,  484,  258,  286, -426,  212,  243,  125, -318,  118,  303,
         81, -318,  264,  192, -500], dtype=int32)
%onnx::Conv_176, shape: [1, 1, 192, 32], exponents: [-7], docString: layout ==> N16HWC16, 
value: array([-68, -26, -35, -16, -14,  38, -24,  43,  64,   8,  14,  25,  32,
       -16,  -8,   4,  -1,  15,  11, -13,  -9, -54,   4,  42, -14,   8,
       -31,  25, -47, -23,  -5, -32, -31, -17,  17, -26,  79,  -1,  23,
         2,  -8, -24, -46,   7,  51,  -6,  46, -24,  16,  20,  -1, -18,
         6,   3,  17, -18,   0, -38, -61,  -2, -21, -18,  20, -19,   7,
        21,  11, -16, -15,   9,  -1,  35, -15,  -9, -28, -10,  20,  30,
       -29, -18, -20,   6,   3, -29,  -9, -15, -18, -41, -39,  19,   5,
        29, -10,   7, -18,  -1,  25,  -3,  44,  13,  18, -34,   4, -13,
        25,   5, -10,   1, -17,  16,  25,  21,  39, -39,  16,  28, -15,
         7,  11,  -2,  20,  23, -30, -48,   3,   8,   0, -16,  30, -23,
        35,  19,   9, -14, -25,   4,  30,  -3,   5, -40,  19,  -7,  -2,
       -32,  26,  -3, -13,  68,  -3,  20,  29,  22,  42,   6, -60, -36,
        25,   4,  19, -31,   5,   3,  14,   1, -22,  60,  15,   4,   2,
         7,  -7,  53,  -1,  -8,   5,  18, -32,  -4,  19,   1, -20,  46,
        -7,   7, -21,  15,  -3, -10,  16,  -6, -27,  -3, -17, -24,  22,
        24,  19,  29,  -5, -15,  38, -23, -22,  18,  32,  -6, -11,   0,
        -4, -29, -20,   3,  16,   1, -39,  -7,  25, -16,  19,  27,  29,
        -1, -23,  -2,  12,  -8,  10,  -3, -13,  59,  10, -11,  39, -26,
        -7,  29,  10,  -7, -48, -19,  27,  -5, -30,  24, -19,  -5, -52,
       -17,   5, -13, -27,   9, -25,  27,  28,  -1,  17,   9,  21,  18,
        14, -23, -17,  -7,  11,   8,  17, -25, -18,  28,   9, -30,  17,
        13, -12,   5,  -7,  15,  -3,  17,  24,  -7,  15,  19,  24,  17,
        68,  61,   6,  33,  14,  11, -28, -24,  27,  18, -10,  22,  37,
        15, -21,  -9,   5, -31,  20,  17,   0, -15,   5, -18, -44,  30,
         5, -29,  14,  -7,  24, -36,  14, -54, -32,   4,   4,  -2,  10,
       -13, -18, -38,  27,  30, -16, -38,   0, -13, -14,  -8, -26,   1,
       -10, -26,  32,  10,  -1,  -1,  18, -43,  12,   0, -29,  26,  18,
       -19, -18,   0,  16,   7, -14,  20,  -2,  24,  33,  16,  30,  13,
       -13,  24, -46,  57,  30,  -1,   4, -20,  -6,  31,  41,  41, -53,
        -9,  12, -20,  19, -32,  -3, -27,  46, -19,  -7, -46, -34, -16,
        10,  26,  16,  15,  -5, -49, -16, -22, -22,  25,   1, -19, -18,
       -13,  -5, -12,  15,  48, -27, -18,  26, -24,  20,  13, -48, -22,
       -15, -13, -22, -23,   3, -13, -31,   3, -35, -41,  11,  -4, -29,
       -19, -22, -15, -17,  -3,   4, -16, -22,   4,  -3,   9, -34, -25,
       -12,   1,  18,  -6,  -8,  15, -24,   4, -23, -20,  14,   7, -40,
        16, -43, -20, -19, -63,  -9, -15,  25, -19,  -6,   1,  -7, -32,
        33,  13,  10,  -3,   1,  -5,   0, -36, -59,   4,  32,   9, -52,
        38,  11,  -9,   3, -11, -40, -20, -14,   5, -32,   5,  17,  -1,
         5,  -8,   1,  17,  45,  26,  16,  13,  18, -63, -16, -14, -43,
       -18, -64,  33, -30, -27,  38,  29,  24,  31,   3,   1,  -6, -25,
        -2,  25,   7,  -2,  -6,  21,  32, -31,  38,  46,  -3, -22,   7,
       -17,  23, -12,  14,  18,  29, -20,   6,  16, -21,  -4, -13,  27,
        23,  25, -32, -14, -40,   5,  -6,  20,  19, -39, -15,   4, -42,
        33,  -1,   5,   0, -17, -12, -78,  18,  16, -16, -14,  -2, -23,
         4,  19,  27,  -7, -52, -39, -13, -21, -17,  -2,  16,  -4, -12,
       -11,  15, -49,  35,  35,  -2, -25, -14,  45,   4,  15,   9, -11,
       -45,   0,  12, -52, -23,  -2,  31, -48, -11,  -9,  15,   6,  -2,
         4,  17,  27, -38,  -6,  -3, -31,  -8,   6, -19,  14, -36, -39,
       -26,  -4,  -6,  17,  -9, -23,  32, -17,  -8, -26, -17, -19,   2,
       -24, -11, -16,  31,  11, -16,   0, -21, -19,  -1,  41,  34,  58,
        -7,   5,  42, -22, -16,  46,  20,  -4,  17,   3,  -6,   7, -47,
        -7, -14,   8,  33,  16,  16,  19, -17,   3,  -2,  37, -19, -17,
       -22,  25,  23, -17, -21,  -3, -15, -58,  35,  10, -18,  12,  -5,
        -9,  26, -10,   0,  23, -30,  -3,  21,   4, -24, -11, -54,   4,
       -45, -29,  12, -23,  -3,  -5,   9, -25,  13, -17, -49,  18,  18,
       -25, -60,  -8,   4,  52,  23,  33,  25,   9,   4,  16,  16, -13,
       -22,  -7, -35,   7,  29,  24,  24, -24,  -1,  33,   2,   9,  23,
        -3,   1, -55,  13,   2,  -8,   9,  -8,  17,  11,  -3,  -5,   7,
        23,  13, -15,   6, -10, -29,   7,  26,  19,  13, -38,   1,  51,
       -57,   8, -24, -30,  17,  40,  43, -20,   8,   0,  -3,  25,  13,
        17,   5, -27, -13, -20,  20,   0, -13,  -2,  35,   6, -18,  -7,
       -27,  37,  -1, -19,  23, -27,   3, -19,  20,   8, -34,   3,   0,
        54,  10,   7,  17,   0, -10,  35, -60,  -8,  42,  26,  34,   2,
       -15,   5, -22,  11,  15,  -7, -41,  20,   9,  12,  -2,  30, -22,
        -7, -36,  -2,   0, -39,  21, -47, -14,   5,   3, -39,  31,  28,
        11, -26,   3,  14,  15,  11, -14, -54, -14,  -7, -31, -30,   3,
         4, -19,  43,  -6,  24, -39,  -4,   2,   6,  11, -33,  26,  18,
        18,  37, -21,  38,   5,  -2,   0,  -8,  42, -40,  12,  23, -17,
        39, -19,   7, -12,  -2,  31,   4,  23,  24,  43, -56, -19,  -8,
       -29,   0,  -5, -33,  -4,   1, -10, -46,  17,  33, -15,   7,   9,
         4,  14, -12,  -2,  -2,  33,  11, -40, -35,  -4,  30,   6, -48,
        30,  -7, -33, -12, -29,  39,  -5, -16,  15,  -9,   4, -34,   3,
       -48, -45, -13, -18,  20,  -1,  73, -13,   4, -20,  -2,  29, -34,
        10,   0,   2,  -8,   0, -14,  34, -28,  18, -20,  71, -48,  -5,
        -6,  25,  30,  -7,  19, -23, -23, -29, -12, -18, -18,  16, -12,
        -7,  -7,  18,   1,   8, -26,   2,  -4,  45, -26, -36, -29, -11,
        35, -55, -24,  -2, -10, -36, -25,   5, -15,  -6, -14,  12, -33,
         5,  23,  12, -20, -32, -50, -24,  -1,  43, -10, -10,  -6, -18,
        -4,  45,  23,  60, -44,  36, -19, -31,  40,  54, -33,  14, -12,
       -14, -37,  24,  11, -27,   9,  -7, -30,   2, -49,   4, -44,  19,
        15,   3,  14,  -1, -15, -35,  -8,  -4,  -3,  49,   2,   1, -28,
        -9,   1,  -6,  12, -29,  52,  -9, -21, -27,   5, -23,  21,  42,
         1,  20,   8,   2, -20, -19,   6,  20, -15,   9, -22, -10,  18,
        42,  -7,   3, -27,  -6,  41,  24,  30, -27,  -4, -38,  -5,  16,
        35,  12,  -4, -31, -35,  31, -38,  22, -12,   7,  36,   9,  -3,
       -30, -58,   6,  -5,  38, -38,  37, -24,  22,  21,  54,  32, -42,
        -2,   8, -22,  25,  27, -19,  10,  39,   4,  -6, -14, -35, -29,
       -15,  16,  40, -44,   2,  12, -45,  15,  -7, -10,  -5,  -4,  60,
       -16,   5, -13,  13, -17, -27,  -3,  54, -16, -18,  -8,  17, -18,
        13,  20,   5, -16,  12,  -1,  -9, -20,  27, -17,  38,  14, -38,
         5,  41,   5, -33,  -2,   4,  25,  -8,  39,   3,  10,   6, -19,
       -15, -63, -13, -34,   3,  33,  28,  10,   2,   5,  27,  15,   3,
         9,  17,  -9,  32, -10, -17,  10,  21,  27,  42,  -1,  11,  25,
       -38, -36,  16,  33, -18, -58,  -7,  -3, -10,   1,   3,  -4,  28,
        10, -17, -29, -45, -32,  23,  25,  -1, -10, -30,   7,  -8,  20,
        19,  14,  19,  -1,  81,  14,  29,  31,  -3,  22,   5, -16,   9,
         3,  11,  -3,   3,   3,   0,  14,  29,  -6,  -4, -10,  21,  42,
        15,  84,  24,  37, -48,   1, -13,  -5, -15,  17,   0, -30, -11,
        13,  52,  27,  39, -13, -10, -12,  27, -14, -51,   9,  19,  53,
       -24, -54,  17, -26, -29, -34, -25,  12,  23,  -4, -19,  -7,  39,
         6, -40, -15, -52,  -9, -57, -26, -26,  33,  28,  36, -27,  16,
        36, -33, -29,  17,  -7,  30, -29,  40,  21,   7, -32,  -2, -15,
         5, -25, -11, -18, -25,  15, -12,  11,   2, -24, -50,   1,   8,
         7, -24, -14, -53, -16, -21, -24,  -8,   9, -15,  19,   2,   6,
       -14,  31,  31,  37, -57,   4, -52,   9,   3,  12, -13,   6, -14,
        20,  -9,  36, -42,  34, -19,  15,  10,  17, -45,  21,   1,   9,
       -28, -38,  43, -34,  15, -15,   2,   2,  25, -45, -28,  43, -27,
        10,  29, -41, -11,   1, -39, -31, -33, -22,  30,   5,  21,  19,
        39,  19, -13,  -1,  17,  20,  -2, -10, -14,  60, -19, -21,  39,
       -10,   8, -39,   5, -25,   4,  19, -41, -59, -43,  26,  20,  -3,
         5,  49,   4,  22,  17,  78,   2,  12,  -4, -15,  10,  -5,   8,
        10,  26, -37, -24, -43,  -9,  37,  35, -27, -48, -10,  50, -10,
       -12, -15,  -3,  -7,   9,  -6, -11,  30, -21,  -9, -48, -28,  20,
        -5, -21,  12,  25,  49,  15,   5, -11,  -3,  -1, -51, -27,  13,
        28, -19,  -9,  36,  29, -26, -15,   5,  14, -27, -47,   5,   6,
        -9, -27, -50, -14,  42,  -2, -32, -12,  16,  -5,  17,   6, -11,
        -2,  10, -48,  13,  28,  11,   6,  15,  -2, -13,  -8,  16,  13,
         7, -26,  -9,   4, -31, -21, -19, -13,  26,  25,   3,   9,  23,
       -20, -48,  31,  19,  10,  23, -30, -38,  14,  14,  -2, -31,   6,
         6, -15,  40,  40, -39,  18,   3,  27, -11, -24,  10,  -9,   0,
        21, -33,   5,  34,  18,  -6, -26,  -3, -39,   7,  -3,  25,  10,
        17,  -5, -14, -60,  26, -19, -15,   2, -29,  -6, -42,  -4,  20,
        14,  23,  32,   8,  29,   4,  58, -21,  19, -20, -27,  -2,  66,
         4, -11, -41, -20,  -4,  16,   3,  20, -14, -32,  -4,  43,  47,
        -6,  -6, -27,  30, -11,  32, -10,  10, -18,  22, -10,  20, -14,
        34,   2, -54, -29,  15,  23,   6,  62, -18,  28,  -3, -28,  -9,
       -15, -13,  -7, -17,  15, -53,  20,  39,  45,  31, -29, -26,  13,
         8,  -7,  49,  24,  24,   1,  -6,  -4,  50,  13, -22, -48,  -7,
       -41, -12, -29,   7, -27,   0,   1, -17,   3, -23,  29,   5,  -2,
        -9, -21,  34,  15,  -3, -31,  11, -16, -28, -36, -18,  -7,  -9,
        -9,   8, -27,   0,  25,  13, -13,   5,  -4, -17,  11, -26, -10,
         9, -61, -48,  37,  49,  -5,  33, -16,  40,  22,  -2,  12,  28,
       -15,  17, -37, -12,  -2, -13, -12, -13,   4, -15, -38, -23,  -7,
        47, -12, -22,  25,  17,  -8,   9,  15,  -3, -16,  -1, -33, -25,
        21, -10, -18, -10, -57,  -3, -16,  14,  -1,   8, -29, -12,  31,
         3,  22,  14, -34, -25,  -4,   1,  21, -30, -39,  -6,  27,  40,
       -32,  10,  42, -11,  44, -40, -29,  22,  10,  -8, -24,   6,  34,
        -7,  15, -59,  -5,  47,   7, -32,   0,  30,  15,  21,   1,  -8,
       -23,  17,  -7, -26,  39,   5,  -2,   5,  32,   5, -18,  37, -33,
        48,  19, -22, -14,  -2,  10,   9,  21,  -6,   6,  -3,  48,   0,
       -45, -11,  -9, -23,   1, -26, -16,  -8,  -4,  -5, -11,  12,  -8,
        25, -19, -19,   3, -24,  -1,  44, -10, -49, -45,  -8, -57,  19,
       -11,   1,  17,  10,   8,  24,  42,   1,   1,  15, -18,  -4,  -4,
         5,  20,  31,  -6, -20,  20, -31, -23,  35, -34,  19, -22,  -4,
       -34, -24,  -1, -28,  -8, -22, -33,  25,  18, -63, -75,  -1,   5,
        -9,  24,  17, -22, -27, -12,  25,  -2, -29,  -2, -12,  -4,  54,
        -3, -23, -30, -43, -48,   5,  40,  14, -34,  -3, -11, -23, -16,
       -52, -45,  21, -13,  12, -24, -16,  15,   8, -15,  -6, -15,  -2,
        12, -53,  -2,  -6,  11,  32, -37, -35,   3,  21,  12,   1, -11,
         5,  28,  15,  18,   1,  41, -19,   0,  31,   0,  -5, -60,  27,
         9, -18, -20,  17, -29, -22,  36, -16,  18,  -2,  -1,  -9,   1,
       -18,   9,  47, -46,  52, -17,  17, -14, -37,   6,  15,  -7,  35,
       -47,  -2,  -9, -15,   1,   6, -11,  -1, -24,  49,  16,  -8, -24,
       -47,  63, -20, -23,  -4, -17, -13,  45,  -7,  53,  11,  31,  18,
       -11,  29,  22,  -4, -26,  -9,  16, -20,  -9,  22,   8,  19,   5,
       -41,  18, -10,  18,  21,   6, -36,  30, -12,   7, -13, -53, -14,
        42,  -6,  -1,  17,  19, -27, -33,  -8, -22, -46,  16, -15, -20,
       -22,  -7,  -9,   5, -16,  25,   7,   3,  16,  14, -20,  15,   8,
         4, -15,   1,  29,  10,  21,  14, -31,   2,  -6, -23,  39, -22,
        -5, -12, -17,  18, -16,   0, -11,   8, -44,  -4,   9,  25, -11,
        35,  -6,   5,   1, -27, -16,  -8,  46,  -2, -33,   9, -15,  15,
       -15,  28,  11, -14, -19,  -4,   2, -23,  25,   9,  -9, -43, -10,
        42,  37,  -6,   9, -33,  48, -15,  32, -26,  -2,  -9,  18, -17,
        25,   1,  -4, -16, -14,  25,  31,  27,   4, -41,  12,  18,  -4,
        24,  -9,   8,  -9,  21,  -4,  -1, -11,   4, -32,  98,  -1, -34,
        19,   6,   5,  22,  14,  -5, -23,  32, -42,   9, -38,   2, -19,
        13,  31,  37, -27, -25,  25,   6,   9, -47, -14,  -5,   0,   3,
        51, -34,  15, -22, -45,  12,  -6,   6, -31,   3, -33,   5,  -2,
        17,  18,   5,  44,  46,   6,  33, -26,   0, -20,  25,  14,  -8,
        15,  19,   2,   0,  42,  13, -47,   2,  -5, -49,  14,  26,   0,
        25,  21,  -8,   5, -11, -23,  18, -24, -11,  26,  -7,  -7, -27,
        39,  21,  35,   2,   7,   9,  36,  46, -38, -34,  10,  22, -38,
       -17,  21,   8,  -6,  32,  25,  23,   6,  18, -25,  10,  -6,  10,
        27,  20, -49, -47,  -3,  18,   7,   4,  50,  12, -15,   0, -56,
        13, -18,   1,  17,  24, -25,  -5,  13, -14,   2,  -8,  34,  19,
         9,  -7,  24, -29,  11, -49, -10, -22,  19,  -6, -36, -43,  29,
        -1, -29,  14,   6,  -8, -17,  -7,  22,  -9, -12,   1,  -7,  -6,
        22,  22,  -7,  24, -35,  23,  -7, -13, -25, -11,   6,  -9,   8,
        16,  24, -27,  25,  -6,  28, -19,  -1,  13, -20,  30,   3, -15,
        11, -33,  10, -28,  31,  30, -44, -22,  26, -19, -43, -29, -19,
         7, -20,   7,  16,   1, -23,  11, -43,  27,   2,   5,   4,   0,
        12,  -7,  25, -28, -17,  21,   8,  24,  -5,   0,  -4,  -6,  -8,
        19, -12,   5, -47,   0,  13,  38,  -7,  15,  21, -35,  11,   0,
         5,  30,  48, -30,   3,  28,  18,   1,  -9, -25,   2, -13,  21,
        21,  14,  28, -29,  32,  15,   2,  -5, -36,  10,  34, -28,  12,
        11, -10,  13,  -9, -29,  20,   1, -38, -52, -14,  17,   6,  16,
         7,   6,  -5,  -8, -12,   4,   8, -22,  -3, -20,   3,  24,  39,
       -38, -22,  17,  -2,  39,  -7,  26,   2,  30,  10, -55, -14,  33,
       -39,  16,  35,  35,   4, -20,   6,  13, -11,  52,   3,  42,  12,
        -9,   3,  -4,   2, -17, -17,  21, -30, -44,   1, -12, -21,  -2,
        12,   2, -50,  10, -25,   0,  36,  28, -26,  32, -19,  -8,  -1,
        -2,  -6, -18, -55,   3,  15, -23,  10, -20, -41,  -9, -39,  22,
        -4,  19,   4,  -3,  33,  27, -21,  43,  33,   5, -12,  10, -11,
       -15, -42, -11,  -7,  14, -15, -51, -14,  44,  14,   9,  -9, -18,
       -10, -19,   6,  -4,  23, -18,  19,   2,   6,  28,   2, -15, -23,
        -6,  10,  14, -32,  28,  38,  -1,  -4,  20, -22, -10, -16, -19,
        -2, -17,   9,   9,  14,  -7,   8, -21,  17, -12,  11,  -8,  -1,
         7,  -8,  -5, -10,  -1, -11,  -4,  29,   7,  12,   0,  -1, -13,
        15,   1,   4, -19,  16,   1,   1,  -7, -26,   7, -33,  17,  19,
        22,   5, -22,  -2,  -2,   7,  15, -19, -25,  -4,  -5, -17, -13,
       -39,   1, -19, -31,   4,   4,  13, -15,  16,  33,   1, -13,  22,
        25, -16, -13, -10, -22,  15,  18,  -3,  38,  73, -12, -15, -10,
       -11, -23,  17, -23,  28,  11, -24, -20, -12, -64,   9, -13,   1,
         0,  26, -48, -34, -20,  -4,   1,  11,   7, -27,   2,  -3,  13,
       -16, -14, -37,  -5, -13, -14,  11,  30,  38, -46,  23,  32,  -7,
         7,  10,  32,  30, -33,  15, -15,  14,  13,  12,  -9,   5,  35,
       -10,  23,   4,  22, -23,  17,  34, -20,  -5, -52,  14,  28,  -6,
         3,  -9, -40,  31, -74,  -5,  20, -33, -32,  12,  -8, -17, -53,
       -26,  31, -50,   5,   0, -45,  25,  -7, -15, -24, -13,   6, -37,
        18,   4,  26,  12,  20,   3,  -6, -40,   9,  -1,   8,  29,  10,
        -4,  19, -27,  16,  -2,   6,  17, -12,  -2, -41,  38,  24,  14,
       -45,  -9,  10,  -7,  25,  -8,   0, -10,   7, -27,  21,   2, -40,
        14,  28,   2,  19,   0, -11,  19,  24, -23,  -8, -52,  16,   0,
        28,  11, -19, -32,  24,  -2, -31,   6, -16,  17,  31, -34,  39,
       -35, -25,  12,   4,  29,   6,   6, -11,  15, -23, -39,   2,  34,
        11,  23,  22,   8,  -5,  24, -66,   7,  -5,  18, -36, -36,   9,
        -4, -27, -11,  33, -29,  20,  73,   6,  -9,   6, -12, -35, -32,
       -90,   9, -24, -23,  16, -13,   4,  -1,   5,   8,  -4,   8,  14,
        25,  14,   3,  23,  12, -13,  -7,  18,  39,  44,  23,   5,  24,
        20,   0,   7,  -4,   1, -21,  59, -26,  36,  -7,  12,   8, -28,
       -20,  -8, -27,   0,  15,  17,   7,  29,  32, -16,  51,   5,  -9,
       -13,  57, -39,  23,  39,  11,  -3,  29, -28, -36,  -1,   3,  16,
         3,  45,  -8,  25, -35,   3, -26,  31, -15, -27,  18, -59,  -3,
       -14, -24, -32,  -7, -20,  -2,  16, -24,  28, -56, -38,  20,  50,
        -9,  21, -47, -21,  -1, -15,   9,   8, -13, -25,  -1,  18, -10,
        -6,   7,  16, -31,  11, -11,   3,  36,  -7, -12, -15,  -3,  -9,
       -49,  21, -14, -26, -18,  19,   4,   8,   8,   7,   0,  38,   4,
        -8, -18, -45, -37,   1,  -2,  19,  24,  12, -41, -25, -28,  -7,
       -12,  16,  14,  -9, -12,  22, -29,   7, -16, -11, -29,   8,   0,
        34,  14,   7, -15, -13,  -3,  12, -21,  11, -14,  45, -51, -15,
        35,   5,  14,  15,  36, -33, -21, -17,   9,   9, -36,  -8,   3,
       -29,  25, -22,  59,  -1, -10,  13,   5,  -2,  30,  14,  17, -17,
        24,  35,  -3,  11, -17,   9, -28, -24, -25, -19,  35,  40,  24,
       -66, -11, -18, -31,  15,  27,  19,  40, -36,   0, -20, -14,   7,
        23,  -2,  54,  14,  32,   2,  27, -21, -21, -48,   0, -20,  83,
         4,  -4,  34,  30,   7,  28,  -6,  31,  24,   2,  43,  21, -27,
         9, -28,  51,  23, -12,  30,   5,  37, -11,  10,  -6,  19,  28,
       -14, -55,  17,  24,  22,  11,  29, -31,   4,  25,   4,  36,  -2,
         1,  68,  -3, -13,   2, -16,   0, -15,  -6, -13,  29,  -1,   1,
        -3,  27,  35, -12,  28,  64,   4,  22,  27,  -8,  -2,  61,  25,
         5, -17,   9,  17, -13,   5,  -9, -18,  18, -36,  69,  31, -14,
       -13,   2, -39,  45,  11,  -2, -39,  -1,  -1,  -1,  -5, -19,   1,
         2,  23,  17,  26, -30,   6, -12, -37, -33,  -6,  33, -33,  -2,
         7,  43, -36, -17,  66,  -2,  50, -34,  32,   3,  17,  39,  10,
         0,  -2,  15,  21, -25,  35, -19,   5,   4,  39,   4,   6,  -1,
        11,  27, -40,   4, -18,  39,  -4,   3,   7,  11,  -1, -23, -46,
       -10, -22, -10, -46, -20,  -1,  -9, -18, -52, -52, -20,  26, -21,
        19,  22,   1, -15,  25,  18,  18,   3,  -7,  -6, -12,  15, -10,
       -10,  16,   0,   5,   0, -21,  -6,  23, -24,  -8,  61, -25, -38,
       -12,  -3,  10,  18, -28,  10,   7,  -3,   6,  30, -33, -10, -11,
        15,  15,   8,   5,  10,  27,  58,  23, -23, -42,  48,  48,  26,
       -43, -46, -25,  14,  26, -23,   9,   7,   1,  -6,  13,   6, -26,
         1, -19,  -4,   7,  -6,  -7,  -5,   8, -20,  11,  47,  37,   8,
         3, -19,  27,  27,  -6,  -6, -24, -15,  39,  10,  -6, -23,  24,
        14,  45,  -1,  -3,   9, -21,   8, -40,  26, -16,  13,  -1,  36,
        -3, -30,  16,  17, -21,  -1,  -3,  -9,  -4,  -2, -11,  -1,  -5,
        22,  13,  -2, -18,  20, -10,  14,   9, -34,  20, -22,  -3,  23,
       -43,  38, -34,  30, -18,  -2,  27,   2, -12,  22,  12,  14,  -5,
        13, -11, -10, -26,  -3,  49, -28, -26, -16,  -2,  12,   9,  -4,
       -47,  45,  21, -60, -21,  17,  -1,  46,  23,  -8,  -7,  -3,  -2,
        49, -42,  18,  -8,  21,  23,  37, -31,  28,  23, -15,   4,  -1,
        15,  28,  -6,  15,   8,  34,  64, -20,  21, -11, -30,  -1,  18,
        17, -45,   0,  -4,  25,  -9, -12,  27,  21, -24,  36, -39, -39,
       -19,   4, -36, -17,  11, -24, -29, -33,  13,   6, -15,  -9,  15,
        40,  16, -18,  15,  -7, -27, -21,  40,  -7, -10,  -8,  10,   3,
       -55,  11, -10, -53,  30,   8,  -2, -19,  23,  26,  10,  -5,  20,
         5, -10,  11, -33, -88,  34,  -8, -13,   5, -53, -15,  61, -18,
       -22,  -5, -29,  18,  29,  25,  -3,  -7,  -7, -10,  -1,   2, -54,
       -22, -11,   2, -43,  16,  23, -29,  -7,  17,  -3,   3, -10, -24,
        17,   6,  32, -30, -17,  31, -30,   3,   1,  -1,   5,  -3,  -8,
        -7, -28,   0, -60,  54, -32,  25,  -2, -31,  22,  36,  15,  18,
       -23,   8,  11,  27, -47,  28, -37, -36,   4,  12,   3,  31,  49,
       -16, -17, -11,   6,   0, -18, -15, -43,  48,  -5,  18,  36,  27,
       -23,  41, -32,  27,  27, -13,  21,  45,  52,  33, -39,  27, -33,
       -24, -14,  -1,  27,   3,  48, -15,  -2,  -5,  -9, -19,  53,  20,
        13,  12,  -2,  49, -62,  24, -41,  21, -50,  -8, -26,  27, -15,
        -3, -35,   4,  24,  29,  15, -20,  -1,  20,  70, -37,   8,  25,
       -13, -28, -23,   9, -42, -13, -10,  20,  38, -20,  17,  30,  -3,
         8,   5,  14,  20,  24,  23,   6,  31,  17,  24,  22,  -7, -18,
       -44, -19,   0, -24,  -4,   2,   5,   0, -21,   3,   5, -17,  20,
        11,  22, -33, -24,  -8,  18, -51,  17,  29,  25, -10,  17, -10,
        14,   4, -23,  -3,  -5, -40,   3,  -7, -15, -15,  23,  13,  18,
        50,  -5,  -1,  23, -14,  -8,  36,  -2, -17, -52, -10,  40,  32,
        14, -41,  61,   2,   1,   1,  32,   2,  -9,   7, -11,  47, -21,
        -4,   4,  -2,   5,  -5,   2,  48, -12,  25,   9,  -1,   7,   1,
        25, -62, -21,  -1, -37, -10, -44, -24,  10,  -4,  27,  12, -12,
         8, -29,  26, -51,   0, -16, -28, -29,  -5, -36, -33, -29,  -9,
        15,  37,  -5,  20, -24,  20,  -1,   1,  -2,  10,   3, -52,   6,
        39,  24, -20,   3,  24,  22, -21, -11,  -7,  23,  32,   8,   2,
        -4,  26,  22, -21,  14, -21,  15,  -5, -24, -21,  46,  48, -53,
        -8,  51, -40, -64,  27, -25, -14,   5, -14,  32,  29, -12, -38,
       -52, -22,   6,  73,  21,  -7,   2,  22,  30,   3,  25,  29, -14,
        18,   2, -35,  32,  -6,  24, -14,  21,   4, -27,  38, -59,  16,
       -25,  -5, -28,   2,  34,  20,  11, -35,  20,  -4,  14, -14,  37,
       -25,  34, -14, -51,  16,  -6,  10, -25, -28,   2, -14, -33,  18,
        34,  -7,  30,  26, -72, -22, -12, -51,  17, -17,  31,  69,  11,
        39,   5, -30,  26, -13, -36, -12, -27, -48,  18, -24, -11,  28,
        43, -23, -22, -11,  -7,  27,  -3, -34,   0,  -1, -22, -23, -23,
       -12,  26, -16,   8,  27, -31,  -8, -26,  31,  -7,  39,  28, -47,
         5,  45,   2,  17, -15,  48,  10,  34, -19,  -1, -19, -46,   6,
        12, -47,  33,  33,  19,  35,  -5,   7,  27,  39, -37,  -3, -24,
        -3,   9, -22,  17,  60, -20,  19, -33,  22, -13,  -3, -35,  -3,
       -13,   9,  26,  35, -30,   7,   2,  33,   4, -43,  -2,  32,  -7,
         4, -19,   4, -13, -15,  30, -29, -10,  11, -33,  36, -31,  13,
       -29,   9, -10,  26,  45,   4,  28, -39,  16, -14, -29,  18, -30,
        10, -14,  44, -24,  11,  30,  -7,   6, -39, -12,  25, -24, -40,
        16, -18,  -2,  -6, -15,  -7,  48,  35,  -6,  -4,  24,   9, -42,
        17, -48,   4, -32,  -8, -37,  -9,   2,  -2, -28,   8,  40,  -9,
       -22, -21, -47, -24, -30,  67,   3,  50,  13,  22, -14, -24, -11,
        16,  -2, -35,  -5,  11,   4,   2, -15,   3, -20,  21,  -3,   3,
       -39,  11,   6,  25,  -2,  32,  12,   2, -45, -73,  10, -48,  31,
        22,  12, -31,  41, -35, -31,  -6,  11,  10, -11, -11, -18,  -8,
        34,  12,  17, -34,  -5,  15,  25, -25,  -1,  52, -30,  38, -24,
        10,  19,   8,  18, -37,  28, -52, -12,   8,  31,  11,  -4,  34,
        21,  28,  -1, -28,   7,   0, -13,  54,   9, -42, -10,  -1, -24,
        -9,  36, -44, -18,  -8,   1,   3, -30, -46, -34, -42,  17,  -9,
        14, -10, -28,  28, -37,   8,  10,  23,   1,  25,  45,  58,  -8,
       -43,  -7, -26, -14, -27, -16, -67, -15, -27,   1,   4,  19,  26,
       -11,  51, -15,  20,  -9, -45, -17,  19, -30,  45, -15,  15,  15,
        20,  18,  15, -37,  -4, -26,  52, -26,  -1,  18,  21,  17,  16,
        34,  14, -25,   5,   2,  14,  10, -31,  14,  17, -29, -22,  22,
        38, -41, -14, -10,  -8,   6,   2,  33,   9,  -4, -39,   4,  10,
       -22, -25,  33,  28, -28, -33, -37,  -1,  40, -31,  13,  18, -23,
       -57, -46,  30,  13,  -7,   3, -27,  14,  25, -32,   9,  -4,  32,
        -4,  19, -52,  10,   6,  -9, -31,  23,  35, -10, -29, -10, -48,
        -6, -10,  42,  -8,  -5, -12, -45,   6, -32, -77,   4,   9,  -8,
        18, -39, -21, -11, -30, -13,   7, -25,   2,  15,  20,  43, -83,
       -14,   6,  20, -48,  -6,   4,  33, -11,  -9,  40, -34, -40,  23,
       -10, -29,  -9,  -1,  12,  10,  -3,  14,  -7,  10,   5, -18,  19,
       -13,  18,  13, -22, -12,  -4,  -8, -14, -31,  50, -32,   8,  -9,
       -47,  19,   6,  -4, -25,  16,  -2,  50,  52, -10,  13, -18, -27,
        10, -20, -11,  39, -32, -17,   3,  -6,  70,  -9,  29, -20,  19,
       -52, -58,  18,  20,  76,  -4,  18,  18,  10,  -3, -26,  18, -35,
         8,  13, -11,  -3, -26,  20,  39, -24, -18,  22, -28, -24,   4,
         6,  10, -26,  16,  43, -27,  -1,  57,   8,  18,   4, -23,  -2,
       -10,  -9, -16,  42, -36,  46,  15,  50, -25, -14,  16,  -6,  42,
       -19,  10,  -1, -13,  21,  13,  10,  -1,  -5,  12,  -7, -32,   8,
       -12, -38, -10,  11, -17,  31,  28,  -2,   6, -39,  14, -31, -27,
         7,  24,  31,  13,  -7,  21, -20,  24, -26,  11,  -5,  27, -11,
         1, -27,  58,  17, -22, -13,  16,   6,   6,  10, -10,  -6,   7,
        28,   4,   9,  57,  38,  -2, -21,  22,  11, -13, -20, -22, -13,
         7,  -3,  20,  26,  49,  -9, -52,   0, -35,  36,  17,  10, -46,
       -13,  41,   0,   2, -21,  14,  12, -17,  50,  50,  37, -69,  -8,
       -11, -11, -17,  -8,   6,   9,   1,  23, -19,  20,  40, -25,  13,
       -52,  27,  11,   7, -15,  26, -23,  32,   6, -13,  61, -17,  -1,
       -33,  -6,  21,  27,  11,  14, -53, -13,  36,  -8,  -7,  -6, -23,
        -5,   6, -29,  10, -97,  23, -52,  28,  16,  28,   8,   1,   2,
       -10, -17,  -8, -32, -14,  29,  15, -11,  -9, -15, -19, -19,  74,
        18, -14,  -8, -36,  13,   2, -25,  46,   7,  -6, -17, -48,   5,
       -23, -15,  20,  21,  38,  -1,   6,  -3,  12,  -6, -20, -12,  13,
        -9,   9,   6, -59,  20,  37, -11, -16, -27, -16, -17,  -9,  -2,
        -8,   2,  35,  59,  26,  39,   8,  17,   4,  12,  55,   0, -22,
        -4, -15, -39, -20,  28,  27,  43,  35,   4,  -5, -26,  11,  18,
       -17, -14, -39,  31,   8,  -2,   5,  18,  19, -20, -60,   5,  -4,
        21,  24, -17,  -5,  12,  12,  -5,  16, -22,  11,  22,  37,  26,
       -17, -28, -42, -29,  -7, -19,  -8,  12, -18, -54,  27,  18,  55,
       -12, -11, -38,  56,  18,  45,  19, -19,   0,  19, -24, -33, -28,
       -13, -14,  -6,  18,   6,  47,  15,  -6,  10,  16, -26,  25, -14,
        26,   3, -15,   9,  -9,   8,  11,   0,  50, -32,  23, -12, -42,
       -53,  24, -37,  21, -46, -19,   4, -34,  20, -10,  29,  29, -11,
       -40, -15, -14, -12, -53,   2,  -6,   3, -12, -14,  -3,   9, -14,
        19,  28,  42,  -6,  35, -73,  -5, -16,  85,   2,  22,  11, -28,
       -29,  15,  19,  31, -21, -69,  28,  35,  20,   2,  10,   6,  17,
         2, -51, -39,  12,  -1, -24,  64,  -3,  57,  19,  10,   9, -10,
        17,  31,   1, -30,  36,   6, -23,  33, -18, -16, -11, -26, -35,
       -29,   2,  66,   5, -19,  20,  32,  22,   4,   5,  -7,   0,  23,
        -7, -28,  -7, -50, -31,  60,  41,  11,  -9, -21,  16, -17, -15,
       -40,  -6, -18, -25,  14, -18,  -3, -35,  31, -27,   9,  31,  17,
       -46,   2,   7, -33, -31,   1, -17, -29, -13,  12,  30,  15,  19,
         0,  -2,   8,   3, -13,  28,   8,   4,  -2,  25,  28,   9,  56,
       -18,   4,  23,  17,   0,  -6,  -6,  -8,  -7,  -2, -11,  15, -60,
        63, -20, -19, -23,   9,   6,  21,  24,   3, -53, -10,  10, -19,
       -31, -23,  -8, -10,  28, -10,  11, -99, -10,  26,   5,   0,  34,
        -4, -36, -32,  11,  14,  12, -32, -30, -24, -12, -23, -52, -22,
       -21,  13,   6,  24,  16,  -9, -38,  11,  20, -14,   4, -47, -10,
        -9,   8,   9,  23,  25,  13, -26,  -9,  27, -25,  25,  26, -26,
        -9, -19,  -7, -29,  23,  -7,  19,  -1,   5, -26,   7, -10, -12,
       -10,  13,   0,   6,  -7,   7,  10, -37,  24,  -8, -32,  24,   5,
       -13,  18,  -5,  -9, -13, -35, -29,  35, -39, -35,  39,  -7,  27,
        26,   3,  -5, -26,  22,   9,   2,  -1, -61,   2,  25,  26,  26,
        -6,  -4,  14, -11,   9,  38, -48,   0, -13,   9,  -3,   3, -46,
        52,   7,  13,  58, -58, -15, -28, -12,  14, -19,  15,  40,  40,
       -17, -28, -23,  22,  -5,  33, -20,  15, -26,  43,  25,  24,  -3,
       -13,  21, -13,  64, -67,  29,  -4, -37, -20,  22,  18, -14,  35,
        30,  39,   5,  47, -14,  -5, -47, -26,  46,  -8, -34,   0,  51,
        -4,   8, -43, -14,  35,  -6, -39,  -8,  36,  25,  28,   0,  22,
       -36,  38, -16,   2,  25,   7,  17,  -2, -14,  24, -36,  -1,  14,
        85,  -1, -30, -11,  27,  21,  20,  33,  43,  -3, -13, -31,  -2,
         3,  -8, -62,  -8, -38, -15, -26,   7,  -4,  12,  -8,  -2,  -5,
        23,   1,   0, -11,  19,  -6,  28, -20, -44, -43,   4, -34,  24,
        21, -20,  13, -45,  31,   5,  27,  -5,   3,  17, -46, -42,  -3,
        -6, -16,  29,   2,  35,  15, -14, -17,  13, -17,  36, -46,  42,
       -39,  60,   7, -16,   9,  34, -30, -10,  -8,  40,  19,   5,  -1,
        32, -40, -10,  -5,  12,  18,  10,   9,  -3, -43,   0,   8,  20,
         9,  -6,  -1, -24,  53,  -3, -11, -50,  -3,   5, -16, -14, -19,
        38, -14,  25,  35,  14,   3, -15, -17, -26, -26,  -9, -13,  13,
        -3,  10,   3,   7,  13,   4, -27, -31, -36, -30,  -7,  31,  -4,
       -14,  35,  -8,  15,  -5,   4, -12,   7,  16,  -8,  10, -49,   3,
        10,   4,  -8,  -6,   5, -15, -29,   2, -13, -27,  24,  -2, -40,
         2,  18,   2,  42, -30,  -3, -51,  11,   6,  -7, -27,  19,  23,
       -13, -49, -35,   6, -24, -21,  10,  20,  33,  -8,  -9,  69,  15,
        -1,  28,  12,  28,  12,  17,   2,  29,   4,  33,  30,  42, -11,
        24,   3, -24,   8,  -9, -31,  -8,  43,  47, -29,  -2,  30, -17,
       -10,  12,  25, -49, -19,   6, -25,  -5, -18,  15,   3,   4,  -3,
       -11,  36, -31, -23, -15,  -1, -11, -16,   4,  30,   8,  15, -24,
         9, -16,  34,  -1,   6,  12, -13,   9,  -4, -48,  -2, -19,  12,
       -15,  14,  19,  17,  11,  12, -24,   8, -17,  -4, -17, -26,   8,
         8, -22,   5,  -9,  17,  -2,  14,   6, -20,  35, -47, -19, -24,
        39,  26, -13,   0,   6,  23,  35,   3, -18,  19,  16,  -2,  12,
       -25,  -2,  -4,  28, -14, -60,  28, -28, -31,  30, -14,  -5, -15,
         8, -16,  31,  11,  -2,  20, -37,  39,   2,   2,   6,  49, -16,
       -22,   4,  14, -25,   2,  -4,   8,  20, -10,  56,  -8,   6,  -8,
        35, -11,  -2, -32, -28,  -4, -13,  24,  53,  12, -36, -16,  -7,
        27,   4, -12,   7,   5,  25, -59,  -8,   3,   7,   3,  25,  23,
       -12, -11, -28, -30,   6,  20,  17, -21, -10,   6, -10,  13,  32,
         3, -21,   4,  -5,  -5,  13,  20,  46, -49,  17, -10, -13, -19,
       -42, -12,  -1,  -9,  20,  23,  31,   2, -27,   1,  58,   2,  10,
       -14, -13,  58, -11,  20,  13, -39, -24, -28,  -3, -67,  32, -74,
        34, -29,   5, -11,  37,  47, -33,  54,  -8,  25,  -4, -36, -27,
        28, -41,  21,  38,  25,  26,  -5,   1,  32,  -7,  40,  12,  -6,
       -10,  -9,  -7,  -9, -36,  -3,  19,   4,  26,  -1, -13,  28,   3,
       -18, -13,   2, -23, -15, -12, -28,  19,  32,  -2,  35,   4, -22,
        39, -31,  13, -44,  -6,  14, -16, -24,  -2, -26, -20,  33,  35,
        35, -27,   0,  48, -19,  27, -15,  17,   8, -33, -18,   6,   9,
        -5,  11, -40, -19,  -4,   4, -25,  14, -49, -12,  26, -29,  -7,
        24, -18,  36,  33, -33, -15, -41,  14,  46, -22,  19,   1,  12,
        -4,  36,  18, -20,  -5, -34, -13, -23,  47,  38,  51, -46,  51,
        35,   4, -33, -26,  -9,  12, -30, -12, -41,  -7, -23,  40, -15,
        18,  -3,  13,  50,  12,  -2,   6,  13,  -5,  -1,  26,  36,   0,
        10,  31,  28,   9,  16,  41, -14,  50,  33,  -7,  17,  -2, -10,
       -25, -51,  14, -20,  44,  26,  12, -19,   0,  16,   6, -21, -17,
       -28,  -3,   4,  24, -42,  -2,  25,   6, -15,  31,  14, -29,  -4,
        11, -24,   2,  11, -14,  -8,  29,  30,  -8,   8,  49, -18,  31,
       -17, -10, -86,   5,  -6,  11,  -8, -56, -20,  22,  17,  24, -33,
        15, -41,   9,  25, -42,  13,  -9,  25,  -9,   0,   4,  -9,   4,
       -72,   0,  63,  -4,  19,  14,   0,  55,  17,  30, -10, -27,   7,
         1,   2, -25, -17,   0,  59, -15,  17,   8, -22,  27,  52, -13,
        -5,  30,  -8, -10,  -2,  21,  12, -34,  25,  47, -31, -25,  14,
        54,  -9,  -6, -19,  11, -12,   0, -13,  42, -53,  31,   9,  38,
        21, -20, -58,  30,  41,  -8, -43, -31,   0,  -1,   5,  30, -41,
       -46, -30, -36, -11,   3,   5, -26,  14,   7,  27,   0,  -1, -52,
       -37,  13,  -2, -14, -19,   8,  -9,  25, -42,   9,   4,   7,  22,
         3,   2,  16,  23, -19,  27,  21,  16,  14, -13,   7,  34,  47,
        -2,  31,  21,  12,   2,   3,  15, -43, -19,  27,  13, -14, -36,
         8,  22,  -1, -46, -14,  16, -49,  27,   8, -22,   6,  19, -33,
       -66,  46,  59, -11, -47,  23,  28,   7,  15,  14, -30,  33,   5,
       -11,   2, -16,  34, -26, -10, -38,  44,  -7,   6, -26, -27, -21,
       -10, -18, -10,  13, -38,   5, -24,  61,  30, -11, -14,   6, -31,
       -39,  14,  11,  -1, -14, -41, -27,  36,  -1,  22,   3,   0,  -4,
        31,  11,   7, -26,  -5,   2,   8,   0,   7, -30,  24, -19,  65,
        -4,  -2,  34, -14,   3, -32,  -6, -21,   4,   2,  34, -23, -28,
        20,  -5,  40,  36, -22,  -4,  17,  37,  36, -10, -23,  -2, -14,
       -27,  -5, -24,  12,  -8, -11,  59,  25,  17,  -1,  -8,  17,  42,
        17,  11,   2,  32, -14, -11, -18,  -7, -42,  -2,   2,  43,  27,
         1,  52,  -9, -33,  29,  10, -44,  17,  -6,  19,  26,  -8,  -1,
        36,  20, -36,  20,  18,   0,   1, -34,  -4,   9,  19, -35,   5,
       -18,  -6,  -6,   8, -18,  -7,   7, -39,   2, -37,   6,  10,  25,
        10, -21,   1, -30, -50, -30,  17, -27,  33,  21,  -7,  30, -26,
         2,   0,   3,   0, -29, -30, -58,   4,  40,  12,   8,  13,  -7,
        14, -59,  18, -17,  -9,   0, -10, -17,  13, -26,  18,  76, -10,
        21,  24, -25, -12, -29, -14, -29,  20,  -1,  -2,  -5, -17,  49,
       -11,  -2, -29,  -8,  32,  15,   0,  15, -32, -23,  -9,   2,  21,
        26, -45,   3,   7, -14,  33,  13,  -1, -11,  51,  -3, -26,  -7,
        10,   0,  25, -15, -11, -29,  -6,  26,   3,  27, -21,  40, -23,
       -18,  25, -31,  38,  23,  24,  -5, -27,   3, -15,  -6,  -5,  -4,
        -2,  12,  17,   4,  52,   9,   1,  16,  37,   6, -95, -34,  38,
        -7,  34, -15, -61,  37,  13,  13, -26, -19,  22,   7,  34, -38,
        -9, -59,  33,   9, -16,  15,  20,  -3,  25,  16,  -2, -13, -11,
        -5, -30,  14, -25, -26,  49, -42,  18, -10, -29,  -8,   1,   1,
        -4,  31,  19,  33, -39, -41, -41, -21, -24,   4,  27, -23,  32,
       -13, -13,   0,  22, -33,  27,   0,  -5, -33,  20,  29,  12, -30,
        -4,  -1,  32, -11,   4,  47, -55,  36,  -3,  -1,  -6,  49, -11,
        49,  59, -20,  12, -24,  22,   8, -11], dtype=int8)
%/layers/layers.0/conv/conv.2/Constant_output_0, shape: [1], exponents: [-4], docString: layout ==> UNK, value: [0]
%onnx::Conv_149, shape: [1, 1, 96, 24], exponents: [-7], docString: layout ==> N16HWC16_UNALIGNED, 
value: array([ 15,   3,  -7,   8,  16, -45,   2,   0,   9,  19,  28,   6,  -5,
        35,   5,  -6,   4,  11,  15, -49,   8, -16,   7,  16, -20, -19,
       -46,  11, -14,  21, -21, -32, -12,  15, -13,  12,  -7, -45, -20,
        11, -13,  -9, -28, -22,  10,  -6,   3,  -5,  -3, -29,  10,   2,
        16, -13, -20,   4,  28,  17,  -7,  24,  18,  28,  -6,  42,   8,
         0,  -3,  -9, -17,  22, -29,   9, -32,  -3,  36,  26, -22,  -8,
         1, -29,   9,   7,   7,   5,  -3,  22,   0,  12, -24,  -2,  19,
         5,  40,  -7,   9,  24,  -8,  19,  -8,  24,   7, -29,  -1,   5,
       -27,   4,  -9,  22, -10, -10,   2,  -2,  13,  -2, -47,   3,  11,
         1, -36, -31,   9,  -6,   3,  -4, -22,  -2,   3,  22,  17, -24,
        28,  23,  10,  19, -14,   4,  26,  -1,  10,  -3, -20,  20,   2,
         1,   5,   8, -23,  10,  19, -13,  -7, -18,  -6,  12,  13,  38,
       -20,  10,   4,   1,   0,   2,   8,  36,  -4,  -6, -10, -25,  -7,
         2, -20,  15,   1,  -7,  14,   8,   3, -15,  20, -18,   1, -18,
       -64,  21,   2,   6,  19,   5,   2,  -4,  -6,   2, -11,   3,  37,
        -9, -10,  -5,  -7,  37,  14,  24, -29, -16,  25,  -6,   1, -24,
        13, -10,   1,  -4, -12, -14, -27,   0, -16,   3,  19,  19, -20,
        21,  16,   7, -17,   7,  16, -15,   2,  20, -17, -30, -20,  -8,
        30,   3, -16,  25,   3,   1,  18,  13, -12,   0,  15, -26, -11,
        -3, -12,  -4, -36,  26,   4, -10,  -3,  16,  -7,  -8,  -1, -11,
        -9, -29,  33,  21,  12,  -2,  11,   0,   1, -17,  -4, -10, -13,
        -7,  11,   7,  -1,  27,  -2, -14,   0,  -3,  -2, -19,  -6,  -5,
         6,  -3,   8,  27,   2,  -6,   6,  -4,  13, -14,  -1,  13,  24,
        -8,  -5,  -8,   4, -13,  17,  11,  12,  10,  -6, -24, -24,   5,
        -5,  -2,  11,  13, -32,   6,   6,  23, -11,   5, -26,   4,  -2,
       -11,  12,   3,   2,   9,   9,  25,  15, -10,   2,   2,  16,   8,
        -9,   9,  -2, -10,  25,  10,  -2,  -6, -27,   3, -11,  12,   2,
         2,  12,  17, -42,   2,   8, -46,  -8, -36, -24,  -4,  -8,  10,
        -9,  25, -14, -10,   8,  -7,  -1,  33, -20, -35,  22, -10,  -3,
       -12, -18,  12,  -6,   9,  -2, -11,   5, -27,   6, -13,  -8, -28,
        25,  -9,  18,   5,  10,  -5,  -2,  20, -17, -21,  -9, -14,   2,
        11,   1, -13,  11,   2,   1, -21,  28,  16,  32,   2,  -2,  51,
        18,   1,  -1,  -2,  18,  -1,  -1, -15,  23,  17,   0,  28,   2,
        -5,  -3,   2,  11,   0,  -2, -32,   3, -13, -27,   5,  12,  14,
       -17,   5,  17,   1,  16, -11,  -3,   9,  17, -22,  18,  68,  19,
        24,  18,   6, -11, -10, -29, -27, -19,   7,   6,   6,  -8,   2,
        -5,  20, -27,  31,  -1,  -5,  13,  11,  18,  17,   4,   5, -11,
        14,   6,  23,  -8,  18,   5,  29, -12, -13,   0,  14, -30,   0,
         5,  10,  13,  12,  12,   0, -12,  28,  35,   9,  24, -18,  12,
       -14,  10,  -1,  -7, -31, -13,   4,  23,   9,  11,  70, -15,   7,
         0,  -5,  -3, -22,  13,   9,  11, -24,  -9,   4,  -5,   4,  -6,
         9, -33,  16,   4, -17,  -1, -18,  18, -27,   6,   9, -13,  13,
        24, -35, -15, -20,  20,  19,  -2,  -6,   5,  -3,   7,   5, -19,
       -33, -12,   9,  12,  -6,  -1,  74, -60,  23, -14, -12,  37, -13,
         2,   1, -17, -38,  -1,  -9,  -5,  23,   5,   6,  -1, -17,  -8,
       -12,   8, -10, -15,  17,   5, -53,  -5, -19,  11, -21,  10,  13,
        34,  11, -15,  27,  12,   0,  19,  -2,  -8,   3,   8,  -5,  18,
         2,  -1,  11,  24, -23,  13,  12, -32,   6, -15,  -1,   0,   6,
       -11,  -2,  -5,   1,   3, -31,   8,  13,  -4,  -5,  10, -17,   3,
         5,  -3, -30,   4, -26, -20, -12, -10,  -7,  -1, -11,  -8,  -2,
         2,  29,  -8,  -8,   1,  28,  -5,  10, -23,   7, -13,  23, -26,
        33,  17, -12, -11,   0, -51,  16,  -7,  15, -11,  -6,  13,  25,
        -6,  26,   1,   5, -12, -24,  16,  -3, -34,   5, -32,  11,   3,
        -5,  31,   1,  -2, -16,  21,  -4, -11, -14,   6, -14, -16,  10,
        15,   5,  -4, -15, -17,  -8,  -1,  -1,  -6, -43, -23, -21,  21,
        46,  31, -11,  16,  -4, -13,  -7,   3,  -7, -15,  34,  -9,  -3,
         4,  -6,  22,  19,  -2,  17,   3,  36,  -2,  27,  15,   1,   6,
       -16,  25,   2,  24,  23,  -5,  -1, -14,   2,   2,   7,   8,  -4,
        39,  17,  15,  -5, -48, -11,  -8,  25,  27,  -9, -26,  -4,  23,
