graph main_graph (
  %input[INT8, 1x96x96x1], exponents: [-7]
) initializers (
  %/layers/layers.1/conv/conv.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_171[INT32, 192]
  %/layers/layers.3/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_146[INT8, 3x3x96x1]
  %onnx::Conv_161[INT8, 1x1x24x144]
  %onnx::Conv_149[INT8, 1x1x96x24]
  %/layers/layers.3/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_150[INT32, 24]
  %/layers/layers.2/conv/conv.5/Constant_1_output_0[INT8, 1]
  %/layers/layers.0/conv/conv.5/Constant_output_0[INT8, 1]
  %/first/first.2/Constant_1_output_0[INT8, 1]
  %onnx::Conv_167[INT8, 1x1x144x32]
  %onnx::Conv_164[INT8, 3x3x144x1]
  %onnx::Conv_147[INT32, 96]
  %onnx::Conv_141[INT32, 16]
  %/first/first.2/Constant_output_0[INT8, 1]
  %onnx::Conv_168[INT32, 32]
  %/layers/layers.3/conv/conv.5/Constant_output_0[INT8, 1]
  %classifier.2.weight[INT8, 1x1x32x8]
  %onnx::Conv_176[INT8, 1x1x192x32]
  %onnx::Conv_140[INT8, 3x3x1x16]
  %/layers/layers.0/conv/conv.5/Constant_1_output_0[INT8, 1]
  %onnx::Conv_153[INT32, 144]
  %/layers/layers.0/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_162[INT32, 144]
  %onnx::Conv_173[INT8, 3x3x192x1]
  %onnx::Conv_144[INT32, 96]
  %onnx::Conv_158[INT8, 1x1x144x24]
  %/layers/layers.2/conv/conv.2/Constant_1_output_0[INT8, 1]
  %/layers/layers.2/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_177[INT32, 32]
  %onnx::Conv_174[INT32, 192]
  %/layers/layers.2/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_143[INT8, 1x1x16x96]
  %/layers/layers.1/conv/conv.5/Constant_output_0[INT8, 1]
  %onnx::Conv_165[INT32, 144]
  %/layers/layers.1/conv/conv.5/Constant_1_output_0[INT8, 1]
  %/layers/layers.1/conv/conv.2/Constant_output_0[INT8, 1]
  %onnx::Conv_155[INT8, 3x3x144x1]
  %onnx::Conv_156[INT32, 144]
  %onnx::Conv_152[INT8, 1x1x24x144]
  %onnx::Conv_170[INT8, 1x1x32x192]
  %onnx::Conv_159[INT32, 24]
  %/layers/layers.3/conv/conv.2/Constant_1_output_0[INT8, 1]
  %classifier.2.bias[INT32, 8]
  %/layers/layers.0/conv/conv.2/Constant_1_output_0[INT8, 1]
  %PPQ_Variable_1[FLOAT, 1]
  %PPQ_Variable_2[INT8, 1]
) {
  %/first/first.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%input, %onnx::Conv_140, %onnx::Conv_141)
  %/first/first.2/Clip_output_0 = Clip[quant_type = 'S8'](%/first/first.0/Conv_output_0, %/first/first.2/Constant_output_0, %/first/first.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/first/first.2/Clip_output_0, %onnx::Conv_143, %onnx::Conv_144)
  %/layers/layers.0/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.0/Conv_output_0, %/layers/layers.0/conv/conv.2/Constant_output_0, %/layers/layers.0/conv/conv.2/Constant_1_output_0)
  %/layers/layers.0/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 96, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.0/conv/conv.2/Clip_output_0, %onnx::Conv_146, %onnx::Conv_147)
  %/layers/layers.0/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.0/conv/conv.3/Conv_output_0, %/layers/layers.0/conv/conv.5/Constant_output_0, %/layers/layers.0/conv/conv.5/Constant_1_output_0)
  %/layers/layers.0/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.5/Clip_output_0, %onnx::Conv_149, %onnx::Conv_150)
  %/layers/layers.1/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.0/conv/conv.6/Conv_output_0, %onnx::Conv_152, %onnx::Conv_153)
  %PPQ_Variable_0 = RequantizeLinear[quant_type = 'F32'](%/layers/layers.0/conv/conv.6/Conv_output_0, %PPQ_Variable_1, %PPQ_Variable_2)
  %/layers/layers.1/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.0/Conv_output_0, %/layers/layers.1/conv/conv.2/Constant_output_0, %/layers/layers.1/conv/conv.2/Constant_1_output_0)
  %/layers/layers.1/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.2/Clip_output_0, %onnx::Conv_155, %onnx::Conv_156)
  %/layers/layers.1/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.1/conv/conv.3/Conv_output_0, %/layers/layers.1/conv/conv.5/Constant_output_0, %/layers/layers.1/conv/conv.5/Constant_1_output_0)
  %/layers/layers.1/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/conv/conv.5/Clip_output_0, %onnx::Conv_158, %onnx::Conv_159)
  %/layers/layers.1/Add_output_0 = Add[quant_type = 'S8'](%PPQ_Variable_0, %/layers/layers.1/conv/conv.6/Conv_output_0)
  %/layers/layers.2/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.1/Add_output_0, %onnx::Conv_161, %onnx::Conv_162)
  %/layers/layers.2/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.0/Conv_output_0, %/layers/layers.2/conv/conv.2/Constant_output_0, %/layers/layers.2/conv/conv.2/Constant_1_output_0)
  %/layers/layers.2/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 144, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [2, 2]](%/layers/layers.2/conv/conv.2/Clip_output_0, %onnx::Conv_164, %onnx::Conv_165)
  %/layers/layers.2/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.2/conv/conv.3/Conv_output_0, %/layers/layers.2/conv/conv.5/Constant_output_0, %/layers/layers.2/conv/conv.5/Constant_1_output_0)
  %/layers/layers.2/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.2/conv/conv.5/Clip_output_0, %onnx::Conv_167, %onnx::Conv_168)
  %/layers/layers.3/conv/conv.0/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.2/conv/conv.6/Conv_output_0, %onnx::Conv_170, %onnx::Conv_171)
  %/layers/layers.3/conv/conv.2/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.3/conv/conv.0/Conv_output_0, %/layers/layers.3/conv/conv.2/Constant_output_0, %/layers/layers.3/conv/conv.2/Constant_1_output_0)
  %/layers/layers.3/conv/conv.3/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 192, kernel_shape = [3, 3], pads = [1, 1, 1, 1], quant_type = 'S8', strides = [1, 1]](%/layers/layers.3/conv/conv.2/Clip_output_0, %onnx::Conv_173, %onnx::Conv_174)
  %/layers/layers.3/conv/conv.5/Clip_output_0 = Clip[quant_type = 'S8'](%/layers/layers.3/conv/conv.3/Conv_output_0, %/layers/layers.3/conv/conv.5/Constant_output_0, %/layers/layers.3/conv/conv.5/Constant_1_output_0)
  %/layers/layers.3/conv/conv.6/Conv_output_0 = Conv[activation = 'Linear', dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], quant_type = 'S8', strides = [1, 1]](%/layers/layers.3/conv/conv.5/Clip_output_0, %onnx::Conv_176, %onnx::Conv_177)
  %/layers/layers.3/Add_output_0 = Add[quant_type = 'S8'](%/layers/layers.2/conv/conv.6/Conv_output_0, %/layers/layers.3/conv/conv.6/Conv_output_0)
  %/classifier/classifier.0/GlobalAveragePool_output_0 = GlobalAveragePool[quant_type = 'S8'](%/layers/layers.3/Add_output_0)
  %PPQ_Variable_3 = Transpose[perm = [0, 3, 1, 2], quant_type = 'S8'](%/classifier/classifier.0/GlobalAveragePool_output_0)
  %/classifier/classifier.1/Flatten_output_0 = Flatten[axis = 1, quant_type = 'S8'](%PPQ_Variable_3)
  %output = Gemm[activation = 'Linear', alpha = 1, beta = 1, quant_type = 'S8', transB = 0](%/classifier/classifier.1/Flatten_output_0, %classifier.2.weight, %classifier.2.bias)
  return %output
}


initializers value:
%/layers/layers.1/conv/conv.2/Constant_1_output_0, shape: [1], exponents: [-4], docString: layout ==> UNK, value: [96]
%onnx::Conv_171, shape: [192], exponents: [-10], docString: layout ==> UNK, 
value: array([ -73,  -43,  -33, -124,   32,    2,  -36, -152,  -49, -160,    8,
        -47, -129,    5, -308,  -70,    7,  -23,  -54,  -42,   -8,  -57,
       -110,  -58, -139,  -40, -105,  -34,  -39,   33,  -23, -207, -118,
        -20,   54,  -43,  -67, -192,  -42,  -73,  -84,    4,  -13,   14,
       -143,  -35,  -90,    5, -192,   -8, -100,  -10,  -73,   36, -107,
        -65,   37, -229, -191,   85, -232,   23,  -76,  -16,  -25,  -64,
       -275,   -6,    7,  -65,   16,  -51,   -5,   63,   81,  -83,   -7,
        -34,  -47, -114,  -75, -320,  -10, -242, -148,  -76,  -65, -102,
        -48,  -15,    8,  -28,   32,   -4,   69,  -32,   28, -320,   63,
        -55, -221, -117,  -26, -281,  -70, -131,  -55,  -10,    6,  -84,
        -70, -283,  -54,  -78,  -33,   -2,  -38,  -93,   22,    0,   -9,
        166,    4, -103,  -74,  -47,    9,  -28,  -41,   -4, -118,   13,
         65, -167,   -7, -314,  -26,   -9,   29,  -12, -140,  -76,   38,
        -48,  -47,  -79,   45,   -4, -127,  -29,  -51,  -15,   13,    4,
        -84,  -18, -255,  -59,   -5,   -2,  -39,  -32,  -26,  -52,  115,
         44,  -30,  -10,   46,   -1,   57,   34,   33, -101,  -66,  -78,
       -203,   54,  -60,  -27,  -49,  -39,  -33,  -12, -147,   13,  -35,
         11,  -22,  -29,  -77,   11], dtype=int32)
%/layers/layers.3/conv/conv.2/Constant_output_0, shape: [1], exponents: [-4], docString: layout ==> UNK, value: [0]
%onnx::Conv_146, shape: [3, 3, 96, 1], exponents: [-4], docString: layout ==> N16HWC16, 
value: array([ -13,    7,    0,    1,  -10,   41,    1,   -4,   14,   12,   -4,
          1,    2,    0,   -6,   31,   -7,    0,    5,    3,  -12,  -32,
         -3,   -3,   10,   -3,   13,    2,    6,   -2,    8,   39,   16,
         -1,    1,   -2,  -13,  -39,    0,    1,   10,   -6,  -14,    7,
          3,    5,    7,   -9,    6,    7,    7,   -1,    3,   21,   -4,
         -5,    6,   -5,    2,    2,   -1,    7,    3,   29,    5,    6,
          5,  -10,    8,   45,   -9,   -5,    4,   -2,  -16,    3,    0,
          1,    5,  -13,   -1,  -30,   -3,   -5,   10,  -92,    7,    0,
          0,    7,    6,   -1,    3,   12,    7,  -47,   -2,   -5,    4,
         -9,   16,   57,   -7,   -2,   -8,  -16,    2,   -1,    5,    9,
          0,   11,   -4,   -2,    1,    7,   13,   18,   -4,    0,  -19,
          8,   -2,    1,    2,   14,    1,    0,  -12,   -1,   -4,   -1,
          9,  -55,    5,   -5,  -17,   12,   -4,    7,    7,    8,    0,
        -27,    1,  -37,    5,    4,    7,  -18,    7,   -4,  -22,  -12,
          9,   -7,  -17,  -31,   -8,   -8,   -3,  -16,    0,    8,   -1,
         35,    8,   -9,  -26,   14,  -14,   21,  -15,  -13,   -6,    6,
        -19,   -3,   -9,    2,    0,   82,   -1,   -6,   13,   17,    1,
         28,    3,    2,  -19,    1,    1,  -39,  -14,    4,    8,   24,
          7,  -20,  -15,  -12,    9,   -7,   -3,  -53,   -5,  -31,    7,
        -19,    7,   11,   -3,  -39,    3,  -42,  -40,   -3,  -14,    1,
          6,    3,    7,   -6,   -8,  -18,   14,   12,    2,   17,   -8,
         10,  -11,   10,    4,    4,    3,  -33,   11,    5,    8,   12,
         -5,   -4,    5,   11,    4,  -15,   -8,    2,    5,   11,    7,
         -2,   -2,   -9,    7,  -12,    7,    5,    0,  -34,   -1,  -43,
         -5,  -12,  -12,   10,   13,   -7,   -3,  -20,    5,  -34,    9,
          9,   -1,   38,   -5,    2,  -27,  -13,   -2,   12,   11,   -7,
          5,  -20,   -1,   10,   32,  -12,    4,  -11,   -1,   -9,    1,
          1,    0,    3,    5,   33,    3,    0,    1,    7,   27,   -6,
          8,   -3,   -1,   -4,   20,    2,   -1,   17,  -11,    4,    1,
          0,    1,    9,  -18,    4,    4,    0,    9,  -11,   22,   -1,
          0,   35,   -1,    2,    1,    9,    2,   18,   10,   -6,    5,
         -4,    2,   -4,    9,    0,    5,   23,   -1,    8,   -4,    5,
          4,   -2,  -13,   -2,    4,   -5,    4,  -48,   11,    6,    1,
        -16,   -6,   11,    2,    6,    5,   -4,  -40,   10,    0,   -4,
          2,  -40,   30,    6,    6,   -3,   -7,   -5,    5,    4,   -1,
        -17,  -25,    2,    8,   -5,   -1,  -19,   -7,    1,   -4,   41,
         -2,   29,    4,    4,    3,   -8,  -84,    8,    3,  -17,    7,
          6,    4,    3,    8,   21,    1,    4,    7,    6,    7,    7,
         -4,   13,    2,   -8,   -4,  -25,   41,    1,    3,   19,   -4,
         44,    1,   -5,   -1,    2,   -1,    0,   -8,   -1,   -6,    4,
        -42,    7,   29,   48,    2,    4,   -6,   10,    2,   30,   -2,
         -3,   -8,    3,   74,   -2,   26,    0,  -21,   -6,    7,  -11,
        -13,   -7,    3,   27,    1,   -5,   -6,   11,    2,    1,   55,
         -4,   23,  -36,    2,  -12,    4,   -5,   -2,  -12,   -2,   -8,
          0,    5,   46,   -2,    0,    8,   -5,  -15,    3,   -2,  -29,
         -3,    8,   12,   -6,    3,   -3,    5,  -11,   -3,   93,    6,
         20, -125,    7,   -7,   -3,   -7,    2,   40,    3,  -11,    2,
         11,  -10,    1,   13,   -8,   22,   30,    6,  -10,    0,   26,
         13,  -28,   -3,   -3,   19,   -1,   28,   -6,  -70,    5,  -15,
        -18,    7,    0,  -24,   -9,    7,   22,   -1,   -5,   14,    7,
        -64,   -7,   36,    0,   26,   21,    6,    8,   -2,   -1,   12,
         11,   -9,  -14,    1,    9,  -10,   -4,  -20,    1,   67,  -11,
          4,   15,  -17,   14,   -3,    0,    4,    2,    5,    0,   -6,
         12,   -1,  -12,   20,    7,   11,   -2,    2,   -4,    2,  -11,
         10,  -45,  -39,    3,    3,    9,   -7,   -7,    1,   -1,   -3,
          3,    3,  -14,    2,   -4,    7,  -11,  -27,    3,   -4,   -9,
         -1,  -43,  -13,   -3,   -1,    2,   -8,    2,    5,   22,   -8,
        -10,    4,    5,  -11,   10,    7,   18,    3,    6,    9,   -3,
          3,  -32,    4,   10,    4,  -12,  -33,    8,  -10,   -2,   -2,
         22,   -3,    0,   -3,    8,    1,  -34,   -1,    8,    5,  -12,
          4,    3,   17,  -16,  -11,   17,  -36,    2,    1,    7,   -2,
          8,    5,   27,   -7,  -30,  -12,    2,   -3,    6,   17,   39,
        -28,    4,    4,    0,    8,  -34,    7,   17,   -6,  -22,   -8,
          5,    4,   -9,    8,  -17,  -39,    4,    3,    5,    7,  -24,
          0,   11,    8,   12,    0,    3,   -5,    2,   -7,    1,  -35,
          4,   -4,    5,    4,    9,   -3,   10,   -2,  -15,    0,   10,
         11,   12,   33,    3,   28,  -46,  -15,    2,   16,   19,   -2,
         -8,   -7,   -4,    8,   -2,   12,    4,   53,    3,   17,   -3,
          5,   -8,    6,   -9,   -8,    3,  -20,    7,    2,   -8,    3,
         -8,  -69,    0,   -1,   27,    0,   -7,    5,   38,   -2,   -5,
        -11,   -5,   11,   17,   -7,    7,   57,    5,   19,  -52,   11,
         -5,   -5,   28,   -1,   -8,  -16,    7,   13,   29,  -12,   11,
         -9,    3,    2,   -6,    2,    0,   -7,   13,  -10,   -4,  -14,
         10,   -1,   24,   -5,    4,   12,    2,   -5,    6,   -3,   -4,
         -3,   22,  -10,   -6,  -17,  -11,    2,   15,   -2,   12,    2,
          5,   -5,    1,   29,   -7,  -15,    6,  -13,    0,  -14,   -1,
         -4,   35,  -14,   11,   -8,    5,   -7,   -2,   -6,    2,   -9,
         18,  -11,   -2,  -22,    5,   -8,   18,   -3,    8,  -33,    3,
         -2,   -1,  -17,    3,    5,   15], dtype=int8)
%onnx::Conv_161, shape: [1, 1, 24, 144], exponents: [-7], docString: layout ==> N16HWC16, 
value: array([ -3,   5,  32, -13,   7,  -2, -18, -16,  19,  24,  20,  27,  -2,
       -16,  12,   1,   9,  -5,  -1,  -7,   4, -36,  25, -14,   4,  -4,
       -21, -17,   9,  17,  13, -14,  21,  17,  -7, -15,  23,  18, -44,
       -46,  25,  -7, -21,   3,  -9,   3,   7, -22, -18, -25,  16,  40,
        -1,  -4, -30,   5,  -6, -12,  22, -19, -13,  -2,  -5,  11,   2,
       -10,  18,   9, -23,  13,  24,  -1,   2,  -9,  -1,  38,   6, -27,
        -6,  18,  12,  -1,  14, -40,  15,  15,  27,  -1,  23,  17,  34,
       -29,   8, -16,   4,  13, -10, -19,   7, -23, -17, -23, -34, -52,
        -9,   5, -31,   7,   0,   7,  -1,   9, -23, -33, -11,   3,  26,
       -16,  -8,  17,  -6,  47,  20,  10,   0, -31,  26,   2, -17, -28,
       -13,  -8,  11,   5,  35,  -7,  30, -12,  -7, -15, -16,   1,   0,
        15,  -1,  -9,  -3, -30,  -4,  31,  23,  17,  51,   0, -18, -11,
       -18,  -7,  18, -13,  -9, -29, -46,  -1,   0, -19,  10,   1,   6,
         5,  13,  -5,  49,   2,  -8,  -8,  24,  17,  51,   3,   4,  14,
        -9,   8, -40,  30,  20,   5, -15,  -2,  13,  17, -22, -10,  15,
       -19, -11,  -2,   9,   6, -16,  -4,   5,  -1,  -1, -12,   5,  23,
        -1,  -3,  14, -20, -18, -25, -21, -26, -19,   1,  27, -24,   2,
        32,   5,   1,  -7, -11,  15,  21,  15, -38, -13,  17, -32,  17,
        28,  26,  12,  -7,  -8,  34, -26, -16, -15,  15,  10,  12,  -2,
        -1, -11,   4,  27,  19,  -9,  10, -27,  11,  33,  26,   3,  32,
        -1,  17, -31,  -2,  17,  30, -18,   6,  24,   6, -20,   3, -21,
        -9, -25,  -9, -16,   1, -15,   9, -37, -11,  -1, -25, -16, -12,
       -27,  26, -24, -38,  -1,  24, -14,   5,  -4,  -3, -18, -17,   9,
        25,  -7, -25, -25,  31,   9,  30,  -3,  25,   5, -67,  -1,  -2,
       -15, -16,   0,   1,  15,  14,  28,  13,   5,  -6,   4, -15,  15,
       -18,  18,  63,   1,  17,  25,  17,   8, -37,  -4,  -2, -14, -20,
         0,  40, -11, -13,   8, -27,  24,   5,  35, -15,   2,   7,  16,
        -5,  13, -32, -28,  -5,   5, -12,  -5,   0,  -7,  19,  -8,   0,
       -15,  13,  17,  10, -17,  12, -10,  -6,  31,   1,  13,  12,  12,
         8,   8,   1,  -7,  11, -18,  -8,   2,  11,   4,  31,  38,  17,
        23,   2, -15,  -2,  12, -21,   1,   4,   5,  32,  -5,  -9,   3,
        40,  13, -28,  45, -14,   8,   5,  -4, -30,  33,   8, -36,  28,
        -2,   2,  -1, -39,  -1,  18,  16, -16,  -2, -14,  28, -20,   1,
        29,   7,  17,   4, -29, -24,  17,   6,  12,  21,  28,  43,  32,
       -21,  26, -20, -27,   6, -22,   9,   3,  -9,  11,   9,   0, -22,
        21,  19,  -1,  -6,  17, -10,  10,   9,   1, -11,  27, -23,   2,
       -17,  15, -40,  -2,  -9, -16,  17,  13,   1,  16,  -7, -15,  29,
        -4,   4,  -7,  -4,  -9,  26,  -1,  -4,  13,  -8, -27, -11,  10,
         1, -21,  -5,  -9,  32,  -8, -42,  -6, -23,  -7,   1, -25,  -7,
       -21,  17,   1,  28,  -4,   0, -22, -16,  17,  27, -19,  14,  -8,
         2,   8,   1,  14,  33,  -4,  27, -27,   9, -19, -19, -52,   2,
         0, -39,   2,  19,  -7, -18,  -1, -15, -12,  -1,  -3, -14,  18,
        -6, -15,  29, -17,  -4,  21, -17, -43,  26, -10,  -4,  10,  29,
         4, -43,  17,   0,   4,   4,   0,   5,  -7,  30,  31,   1,   5,
        12,  17,  -2,   9,   2,   7,  43,  -3,   6,   1,  17, -20,  -3,
        -1,   3, -20, -11, -31,  35,   5,  45,   9, -41, -26,  14,  19,
         4,  -6, -11, -29,  24,  36,   7,  14,  13,   5,   6, -10, -52,
        19, -33,  -1,  -5,  15,   3,   6, -29,  25, -22,  -1,  20,   8,
        11, -20, -29,  -1,  23, -14,  27,   1,   2,  14, -17, -15,   7,
         5,  22, -13,  12,  -7, -13, -14,  11, -30, -40,  27,  10,   7,
       -34, -11,  -6, -23,  -6,  25,  28,   4,   6,  -3,  -1,  -2,  40,
        17,   3,  20, -19,  18,   0, -15,  14, -14,  -4, -19,  18,  14,
         0,  17, -31, -22,   1, -33,   6,  30,  27,  15, -14,  -9,   9,
        16, -41, -10,  54,  19,  17,  -9, -17, -18,  -1,  14, -36, -18,
       -35, -29,  -5, -11,  17,   3,  -6,  -7,  -2,  14,  -5,   6,  -9,
       -22,   9, -22,  18, -12,   7,   5, -21, -24, -12, -14, -36,  30,
        -5, -28,  -9, -10, -33,  50,   6, -10,   5,   5,   3, -30,   5,
        22, -22,  14, -20, -14, -13, -25,   5,   7,  -2,  13, -13,   8,
       -35,  30,  26, -36,  22,  17,  15, -12,  -6,  -3,  -3,  29,  -7,
       -31,  -7,  16,   1,   6,  -3, -14, -27,  34,  -1,  -6, -35,  15,
       -23,   2, -28, -19,   1,  48,   2,  55, -18,  22, -30,  -6,  -2,
        16,   0, -26,   7,  -7,  24,  -3,  16,   8,   6,  15,  19,  18,
        15, -14, -13,   6,   6, -44, -59,   2, -21,  -6,  14, -40, -43,
        40, -15, -15, -10,  -8, -14, -23, -25, -11,  18,  14,  -8,  19,
        16, -17,  -5,  19,   0, -24, -11, -11,   1,  15,  26,  -4,   7,
       -31, -44,  -7,   4,  21,   5,  13,   9,  -9,  -1,  -7, -27,  -4,
       -10,  12,  10, -14, -12, -14,  13,   1, -12, -26,   5,   1,  19,
       -22,  -2, -15,  16,  16,  26,   7,  49,   5,  35,  11,  43,   8,
        12,  12,  24,  18, -14, -18,  23,   1, -11, -21,   9, -10,  -6,
        15, -15, -10,   8,   9,  25,  21,   4,   3, -42,  -5,   0,  19,
        45,  16, -31, -17, -11,   3,  45,  18,  -8,  14, -10,  -2, -27,
         9, -26,   0, -12,  11, -12,  30,  15,   3, -26,  -5, -13,  14,
       -29,   3,  20, -21,   9,  -8,  57,  -4,  13,  17, -18, -13, -10,
         7,  -6,  -4,  29, -13,  37,  27,   6,  19, -44,  13, -19, -27,
         1,   8,  -3,  -5,  -1,   8,  14, -19,  11,  19,   8,  -2,  14,
        -2, -21,   9, -27,  -5,   6,   2, -21, -15, -10,  13, -42,  23,
         5,  21,  -7,  -1,  42, -13,  30,   3,   9, -16,   7,   1, -16,
        26,  -3,   1,  12,  11,  -7,   4,  48,  -8, -35,   8,   5, -19,
        -8, -11, -13,   1,  25,  14,  -5,  21,  -1,  11, -19, -13,   0,
        13,  14,  -5, -16, -21,   6,  35, -20,  31,   9,  34,   4,  11,
       -12,  -5,   4,  -7,  -3,  -6, -14,  19, -10,  -2, -47, -19, -11,
        31,   9,  -6, -55, -10, -12, -22,  11,  -1,  11,  25,   2, -11,
       -16,  23,   3,   5, -15,   0,  38,  23,  -6, -13,   4,  11,  23,
        -5,  17,  10,  17,  37, -14,  13,   6,  -8, -26,  29,  19, -19,
         0,   5,  10,  29, -29,   9,   2,   0,   7,   3,  -3, -16,  16,
        17,  20,  14, -10,  -8, -14,  -2,   1,  19,  -9,  38, -35,   1,
        44,  12,   8, -13,   7,  -3, -11,  13,  -9, -21, -46,  17,  -8,
         3,  13,   6, -11,  12,   3,  16,  24,  -2,  11,   7,  11,   4,
        -2, -12,  12,   3,  23,  17,   6,  38,   9, -10, -22, -19,   7,
        -5,   7,   5,  -4, -10,   2,  25,  24,  -4,  30,   7,   7, -13,
       -23,  12, -36,  -5, -14,  34,  -9,  -4, -26,  19,   1,  11,  38,
        -9, -13,  17, -14,  35,   0,  -4,   1,  -6,  -1,   1,  13,   8,
        -3,   0,  29, -16,  -4,   1, -22,  -4,  14, -10,   6,  50, -19,
       -24,   7,  29, -19,  -7,  19,  -5,   5, -21, -29, -13,   2,   0,
         4,  33, -49,  10,  -5,   0,   0, -16,  17, -29,   6, -12,  -5,
        17,  -9,   2,  28,   6, -10,   8,  -3,  25,   1,   5,  13,   1,
       -45,  17,  -1,   4,  25,  -5, -13,  -3,  -2,  -5,   0,  28,  22,
         3,  -7,  -4, -25,  14,   0, -13,  29, -16, -14,  -9,   4,   0,
        -3,   8, -28,  24,  23, -27,  -2,  -3,   6,  -6,   2,  13, -39,
        -7, -17,   7,  29,   3,  17,  -3,  -8, -20, -15,  17,   7, -36,
        11,  -8,  -4, -11, -47,   1, -22,   5, -19,   7, -29,  13,  -5,
       -23, -25, -25,  -4,  16,  -3,  -2,  15, -14,  -9,  21, -14,   0,
         7,  15, -22,   1,   4,  -1,  35,   1,  -4,  16, -16, -12,   8,
        -3,   3,   0,  -4,  13, -16,  12, -17,  -2,  11,   8, -12,  18,
       -27,  13,  23, -21,  -1, -17, -14,  15,   3, -15,  25,  40, -16,
         6, -30, -16,   6, -12, -11, -24,  11,  25, -13,  12,   1,   8,
         5, -26,   9,  21,  11,  21,   6,   8,   8,   1,  30, -14,   6,
        -4,  -1,  23,  -8,  19,  21, -15, -23,   8,  14,  25,  11, -32,
        36,   8,  -9,   8,  -2, -10, -19,  21, -15,   4,  20,  -5, -29,
       -21,  -9,  43,   2,  -4,  19,  -1,  -8,   1,  -2,  28,  -8,  26,
         5,   3,  32,  25,  -1,   0,  13, -17,  -2, -26, -14,  -3,  24,
         2,  19,  11,  -8, -27, -21,  21,  27,  10,  11,   6,   6, -41,
        17,  -5,  -1,  20,  17,  11, -24,   0,  16,  -2,   4,  60,  13,
         4,   8, -12,  22, -13,  -6,  -3, -16,  20, -28,  -1, -14, -28,
        10,  -1, -33,  -7, -22,  19,   9,   4,   2,   1,   5,   4,   7,
         3,   2, -32,  25, -29,  -8, -20,  -7,  16, -19,   0, -12,  18,
        11,  10,  25,   3,   8, -27, -14, -15,   5,   4,  -9, -11,   0,
        28,   2,  -5,  -6,   0,  -5, -19, -11,   0, -16,  -2,  23,  10,
        11, -25,  29,   8,  21,  13, -51,  -9,   9, -29,  11,   1,  -8,
         4, -13, -11,  -6,  -5, -17,  -5,  25, -10,  10, -11,  -8,  16,
        12, -15,  13,  11,  -6,  29, -37,  21,  31,  -8,  -6,  21,  60,
       -34,  29,   4, -19, -12,   1,  21,   2,  -8,   1, -18,  -3, -26,
        25,  31,  -1,   7,  -4,   6, -18,  24, -18,  11,   3, -11, -21,
        14,   8,  10,  -6, -12, -19,  34, -21,  -7,   6,  17,  -3,   6,
       -27,  -4,   0, -31,  13,  23,  27, -12, -31, -10,   5,  35,   0,
       -33,   2,  11,  18,  25,  15,  46,  16,   7,  -7,  14, -21, -24,
        -4, -13,  14, -18,  -6,  19,  15,  14,  11,  15,  -8,  29, -10,
        -3,  16,  31, -48, -13, -18,   4,  15,  -7,  -4,  16,  13, -16,
        -3,  -7, -14,   8,  -5,  -9, -21,  29,   1,  -6,  11, -13, -46,
       -15, -14, -20,   8,  -1,  12,   3,   5, -34,   9,  23,  -9,  11,
        25, -30,  -1, -13, -18, -18,   0, -28,  10,   2,  39, -27, -14,
       -19,  -8,  -3, -16, -38,  15, -11,   0,   4,  12,  -1,  -8,  25,
        -7,  17,  24, -24,  -8,  10,  11,  29,  -5,   1,   2,  33,   1,
         1, -10, -16,   2,  -7,   1,  -9,  -5,   5,   8,  18,   3, -13,
        16, -12, -14,   0,  -5,  48,  37,  24,  11,  11,  -9,  18,  12,
        23,  -2,   5,  13,   5, -34,   5,  27,  19, -10,  12,   7, -14,
        18,  -8,  16, -19,  -4, -23,  -1,  23,  33,  13,   7,  43,  56,
        -5,   1,  -3,  -8,  26,  19,   0,   1,   1, -30,   6, -20, -22,
        22, -28, -18, -10,   5,   2, -11,  -3,  -4,  12,  -1, -21, -35,
       -21,   8, -15,  -8,  -5,  -9,   6,  -3, -15,  11,  16, -13,  34,
        13, -15, -19,  -5, -14,   2, -12,  -7,   9,   2, -38,  -7,  -9,
         8,  15, -19, -16,  -5,  -7, -20,  -2, -12,  52,  34, -11,  -8,
        -2,  14,  20,  18,  13,  -8,  23,  14,  18,   8, -11, -23,   9,
        -8,  13, -31,  20, -13,  17, -10,   4,  -7,  17,   0,  -8,   1,
         3,   5,  10, -23,  30, -20,   6,  41,   6,  54, -31,  17,   3,
         0,  -7, -30,   3, -10,  -3,   4, -12,  24, -21,   1,  32,  -8,
        -1,  31,   7,  13,  19, -19,  -2, -13, -16,   8, -19,  35,  -1,
        14,  -8,   3,  -8,  10, -14,  12,  26, -13,   3,   5,  16,  16,
        -9,   6, -16,  26, -18, -30,   1, -40, -43,  20,   9,   4,  30,
       -23,  20,  27,  16,  15, -24,  -3,   5,  10,  12,   1, -10,  21,
       -32, -28, -11, -10,  -1,   2,   5,   7,  -2,  -6, -14,  13,  -7,
        12, -10,   2,  30,  10,   0,   6,  18, -15, -12,   0, -12,   5,
        -5,  -5,  14, -24,  -4,  -5,   5,  30,   2,   6, -44,   4, -33,
       -22,  -1,   1, -10,  18, -13,   0, -18,  -9,  15, -15,  12, -12,
       -23, -12,  -9,   1, -14,  -1,   4,   8, -17,   1, -32,   3,   5,
        30, -47, -17, -21, -10, -13, -34,  17,  -1,  15,  23,  -4, -20,
         4, -46,   1,  14, -16,   6,   3, -10,  -8, -33,  -4,   4,  -3,
         2,   9, -35,  14, -16,  44,  16,  27,  14,  10,  15,  -5,  -5,
       -16, -17,  18, -18,  12, -40,   7, -22,  27, -17,  54,  27,   8,
        16,  27,   4,   6, -18,  14, -25,  -6, -26, -57, -17,   0, -26,
        -2, -33,  -6, -28, -38, -12, -17, -42, -11,  24, -34,  -1,   2,
       -22,  -5,   9,  -9,  -4,   8, -28,   5,  32,   2,  13,  -9, -21,
        18, -33, -10,  13, -53,   3, -38,   6,   1, -25, -23,  28,  23,
        37,   4,  -3,  27,  -7,  15,  -1,  24,  26,  -5, -15,  13,  -5,
       -31, -13,  10,  16,   6,   9, -38,  28,  -4,  -7,  -1,   7,  11,
        -6,  -9,   2,   4,   8,   2,  42,  28, -21,  11,  47,  13,   4,
        23, -14,  -3,   1, -15, -10,  -1,   7,  19,  38,  19,  18,  20,
        29,  19,  -1, -29,   3,  28,  33,  -8, -30,  -4, -13, -12,   1,
        -9,  22, -24, -19, -12, -22, -10,  -8,  30, -16,   9,  -5,   1,
        -1,  11,  -1,   8,   7,   4, -17,  30,  23,  18,  40,  11,  12,
        -1,   5,  32,  -5,   7, -39,  14,  -9, -34,  -6,   7,  15, -27,
       -22,  16, -14,   8,  -7, -28,   0,  14,  10,   3, -18,  -3,  -7,
       -22, -28,  33,  20, -31,   1,  18,  18,  19,  22,   4, -24,  -1,
         6, -26, -30,  11,   6, -31, -24,   7,   6,  -3,   7, -11,   9,
         6,   1, -11, -10, -15,  18,   6, -13,  -7,  -1,   5,   1, -24,
       -26,   5,  -3,  -1, -15, -27, -23, -16,  15,  -3, -38,  13, -36,
         9,  20,  -9,  24,   5, -13, -26,  -7,  37,   1,  -9,  -8,  36,
        -7,   2,  16,  22,   4,  28,  22,  13, -23,  10,  -8, -21,  25,
        16, -36,  11,   0,  -7,   2, -39,   9,  -5,  13,   4,   2,  34,
        13, -16, -21,  34,  12, -10,  30,  -6,   8, -10, -11,   9, -26,
        -1,  17, -15, -26,   4,  38, -26, -11,  -8,   6, -34,  -6,  17,
        28,   5, -27,  19,  19, -17,   5,  11,   8,   2,  13,  18, -10,
       -15,   4,   9,  35,   3,  25,  -3, -15,  16,  44, -20, -13,  14,
        -2,  25, -10,  -7, -19,   4,  30,  -7,  -6,   8,   0,  -6,   4,
       -25,  -6,  -1,   1, -25,  -5, -27, -15,   0,  12,   5, -13, -43,
       -10, -16, -16,  -5,   6,   9,   8, -16,  -3, -22, -27, -13, -29,
       -17,  28, -18,  11, -11,  -4,   5,   7,  -4,  27,  26,  10,   1,
        21,   3,  15,   5,  -5,  17,   8,   8,  27,  -4, -16,  17,  21,
         4, -10,  10, -24,  15,   6, -16, -27,  -2,  24,   4,  -9, -14,
       -14, -16,  10,   4,  25, -30,   1, -14,  36,  -6, -41,  22, -10,
        10,  23,  20,  30,  17,  11,   4,  15,  26, -30, -12,  33,  30,
       -11,  17,  25,   4,  -6, -14,  14,   0,  14,  21,   5, -11, -13,
        12, -11, -27,   0,  16,  16,  18, -16,  13,  22,  11,  29,  24,
        -9,  12,   2,   4,   4, -20, -20,   3,  -3,  25,   9, -20, -18,
        10,   0, -28,  13,  -2,   8,  -3, -14,  -6,  29,  21,   9,  28,
        29, -27,  11,  22,  19,   2,   7,   3,  -3,  35, -11,   3, -21,
        -8, -12,   1, -28,  10, -20,  14, -21,   5,  12,  29,   8,  27,
         7,  -2,  50,   0,   6,  10,  29, -31,   4,  25,   6,  28,  -9,
        -2,  -6,  -1, -58,   7,  -3,  13,  24,  10,   6,  34,  25,  21,
        -1,  -1, -31, -16, -20,  16,  -1, -21, -15,  35, -19,  18,  19,
       -22,  -2, -25,  19,  -9,   1, -18,  65, -24, -60,  14, -10,  25,
         3,  27,  15,  16,   9,  12,  13,   1, -11, -30,  15, -13,  25,
        13,  -4,  -7,   2,  18, -37, -12,  13, -19, -17, -16,   8,  -7,
        31,  24, -18, -12, -14,  -6,  10,   8,  36,  -4,  -8,   2,  19,
       -14,   2,   9, -11,  -9,  -6, -10,   5, -19,  -3, -28,  18,   6,
       -20, -18,   3, -35,   6, -23,  25,  11, -21, -25,  -9,   9,  22,
        -7,   5, -32,  29,  -7,  20, -18,  26,  47,  33,  32, -23,  38,
       -22,  37,  37,  21,  18,   3,  -2, -17,   8,  30,  29,  18, -12,
        -9, -29,  35,  19,  13, -34,   4,   4,  25,  -4,   0, -22,  30,
        19, -16,  24,  17,   1,   7,  13,  -2,   0,  37, -18,  -5,   0,
        14,  -6,  30,  20,   4,  36,  -3, -10,  11, -21,  19,   5,  -7,
       -33,  -8,  -6,   0,  23,   9, -10,  -9,  27, -42, -40,  -3,   5,
        -8, -31, -14,   2,   8, -12,   5, -30,  -6, -35, -45,  20, -10,
       -10,   1, -20,   7,  34,  21,   6,   2,   3,  24, -13, -32,  10,
       -61,   2, -39,   9, -14, -37,  -7,  14,   1,   2,  -5,   3, -25,
        15, -18, -17,  -6,   6,   4,   8,   2,  -4,  17, -24,  16,  -8,
         0, -37,  36,  25,  26, -16,  22,   2,  30, -39,  11,   5,  10,
       -19,   0,  25,  15,  19,  27, -11, -16,  21,  12,  -5,   1, -33,
         4, -11,  10,  -2,   0,  27,  20, -19, -44, -23,  -3, -16, -42,
        -4,   8, -10,  21, -32,   4, -13, -26,   4,  -7, -17,   7,  -5,
       -19,  -1,  11,  -4, -38,  18,  -9,   5, -10,  -5,  19,  -1,  -7,
       -13,  20,  15, -21,  -2, -22,   8, -14,   6,  34, -12,  -3,  20,
        18, -20,   0,  16,  31,  -4,  -7,   2, -67,  41, -25,   9, -38,
         9, -20, -15,   8, -54,   1, -14,  40, -22, -14,   7,   3,  -9,
       -40,  -5, -11,   3, -10,  18,  37, -19,   5,  -1,   0,  14,  -1,
       -20, -26,  -5,   5,  30,  11,  13,   7, -10,   1,  19,   8, -24,
        21, -23,   8, -48,  -9,  55,  -2, -15,   0,  11, -31,  29,  18,
       -16,   6, -21,   2, -10,   2, -35, -18, -45,  -3, -21,  17, -18,
        -8, -15,  21, -25,  -5, -20, -29, -16,   4,   0,  39,  -6,  30,
        13,   8,   6,  17,  -6,  -1, -14,   0,  -2,  15, -25,  12,  26,
        14,  22,  -3,  -4,  -8, -16,  20, -21, -19, -10,  -9,  37, -27,
        -8, -33,  -4, -18, -13,   1, -24,  -8,  15, -18,  -4,   8,  20,
       -17,  -7,   4, -16, -18, -16,   9,  -1,   7, -13,  -5,  14,   4,
        18,  34,   7, -23,  25,  32,   7,  -5, -18,  14, -32, -25,  43,
       -20, -37, -22,  -6,  17,  21, -10, -35,   3,  -7, -14,  -5, -29,
       -14,  -4,  -3,  11,  -2,  10, -35,   3,  -8,  39,  10,   7,  16,
       -15,  -1, -23, -16, -15, -40,  28, -13,  29,  -4,   1,  25,  21,
         9,   6,  -5,  14,   0,  11,  42, -26, -34,  -2, -17,  20,  17,
        17, -16,  19,  -7, -11,   8,   1,   3, -30, -30,   9, -25,  10,
       -12, -25, -24, -29, -28,  36,   2, -15,  -2,  39,  33,  -8, -30,
       -16, -24,   3,   8,  15,   1,  16,  -4,   0,   3,   4,  17, -40,
         7, -16, -16,   4, -29,  -6,   4, -17, -38, -15, -21,  21, -32,
       -11, -18,  -1, -23,  -6,   4,  -1,  14,   8,  -7,   3,   7, -51,
        27,  18, -15,  -8, -23,   5,  -7,  13,  -4,   9,   0,  16, -16,
       -11,  30, -19,  -7, -25, -33, -38,   2, -21,  -8,  -5,  -1,   2,
        -9,  12,  27,   4, -14,  -1, -32,  -5,  -8,  17,  -7,   1,   3,
       -21, -12,  25,   0, -34, -20,  23,  -8,  17, -22,   0,   1,  32,
        -6, -12,  -4,  14,   5,  33,   3, -11, -30,  -9,  19,  20, -18,
         5,   6,  20,   5, -23,   5,  14, -15,   5,   0,   1,  13,   9,
        -9,  -3,  -6,  10,  -5,   5,   6,   4, -15, -22, -31,   2, -15,
       -23, -12,  22,  27,  16,  13,  27,   8,  13,   8,  10, -25, -20,
         7,  -8,   3,  18,   1,   3,   8,  -1, -13, -66,   4,  12, -13,
        40, -32, -42,  -4, -20,   8,  14,   6,  -2, -24,   1, -50,   4,
         8, -12,  17, -11, -18, -25,  -2,  15, -16,  10,  28, -12,  13,
         0, -17, -21, -13,  15, -17,  -7, -32,  30, -18,   3,  11,   1,
         0,  31,  20,  -7,   3,  21, -21,   9,  -5, -14,  -6, -24,  -9,
        -1,   7,   2,  11,  40,  -6,  -4,  20,  -3,  10,  43,  18,   1,
        17,  56,   3,  27, -17,  10,  17,  17,   2,   1,  13,  -7, -25,
        12, -11,  -5,  -2,  -2,   3,  33,   7, -40,  -3,   6,  -1,   1,
       -19, -36,   0,   1, -31,  -4,  -1, -25, -11, -28, -13,  -9, -21,
        -4, -26, -11,  13,  23,  24,  -1,  16,  30,   9, -32,  15,   3,
       -39,   4, -22, -12,  -7,   1, -32,   6,   8,   3,  29,  -2,   9,
       -35,   4, -14,  11,   2,   2,   0, -10,  12,  26,  20,   7, -34,
        -1, -15, -17,   3,  12,  16,   9,   9,  30, -24,   3, -24, -14,
       -18, -22,  12,  14,  21,   8, -31,   8,   9, -33, -10,   5,   7,
        30,  11,   5,  -1,  16, -28,   2,  17,  23,   2, -12], dtype=int8)
%onnx::Conv_149, shape: [1, 1, 96, 24], exponents: [-8], docString: layout ==> N16HWC16_UNALIGNED, 
value: array([  26,    4,  -10,   12,   28,  -73,    4,    0,   18,   33,   48,
         12,   -8,   61,    8,   -8,    7,   18,   24,  -69,   13,  -26,
         12,   26,  -38,  -33,  -78,   21,  -22,   36,  -31,  -43,  -21,
         25,  -20,   17,  -12,  -73,  -33,   18,  -24,  -14,  -48,  -41,
         16,  -10,    5,   -7,   -4,  -47,   15,    3,   28,  -20,  -32,
          6,   53,   29,  -11,   44,   28,   48,   -8,   57,   14,    0,
         -5,  -12,  -29,   35,  -48,   14,  -60,   -5,   62,   48,  -33,
        -13,    2,  -40,   15,   11,   11,    7,   -6,   35,   -1,   20,
        -45,   -4,   33,    9,   62,  -11,   13,   32,  -15,   32,  -12,
         34,   11,  -46,   -2,    8,  -51,    7,  -15,   40,  -15,  -17,
          3,   -3,   23,   -3,  -73,    5,   20,    2,  -60,  -50,   18,
        -10,    5,   -7,  -33,   -3,    5,   30,   29,  -40,   42,   33,
         17,   30,  -24,    7,   49,   -2,   17,   -5,  -30,   34,    3,
          2,    9,   14,  -35,   14,   32,  -21,  -12,  -29,  -12,   20,
         22,   70,  -32,   16,    6,    1,   -1,    3,   12,   51,   -6,
        -10,  -16,  -40,  -13,    3,  -34,   27,    2,  -12,   21,   11,
          6,  -24,   31,  -25,    2,  -28, -106,   34,    4,   11,   32,
          9,    4,   -7,   -9,    3,  -19,    4,   57,  -13,  -17,   -8,
        -12,   59,   27,   40,  -50,  -30,   38,  -10,    1,  -32,   22,
        -16,    2,   -6,  -21,  -23,  -45,    0,  -31,    5,   33,   34,
        -31,   36,   24,    9,  -30,   11,   24,  -21,    4,   32,  -27,
        -49,  -38,  -14,   51,    5,  -25,   43,    5,    1,   31,   21,
        -18,    0,   25,  -42,  -18,   -4,  -22,   -6,  -61,   49,    6,
        -18,   -5,   22,  -12,  -13,   -2,  -15,  -15,  -47,   55,   33,
         23,   -3,   19,    0,    2,  -28,   -6,  -14,  -22,  -12,   16,
          9,   -2,   43,   -4,  -22,    1,   -6,   -4,  -35,  -10,   -9,
          9,   -4,   14,   44,    4,   -8,   10,   -7,   21,  -22,   -3,
         21,   41,  -14,   -7,  -13,    6,  -17,   29,   18,   19,   15,
        -10,  -38,  -40,    8,   -9,   -3,   19,   24,  -50,   10,    9,
         32,  -19,    9,  -40,    5,   -4,  -17,   20,    5,    3,   15,
         15,   47,   23,  -18,    3,    2,   27,   13,  -14,   13,   -3,
        -16,   41,   15,   -5,  -10,  -46,    5,  -18,   20,    3,    2,
         20,   28,  -65,    3,   13,  -73,  -13,  -58,  -46,   -6,  -13,
         18,  -14,   43,  -21,  -13,   15,  -12,   -1,   47,  -34,  -55,
         37,  -15,   -5,  -20,  -30,   22,   -9,   15,   -3,  -15,    9,
        -44,    9,  -18,  -14,  -45,   41,  -15,   34,    8,   18,  -10,
         -3,   35,  -24,  -29,  -15,  -22,    3,   16,    1,  -21,   18,
          3,    2,  -35,   49,   29,   49,    3,   -3,   70,   31,    2,
         -2,   -3,   30,   -1,   -2,  -24,   43,   29,   -1,   52,    2,
         -8,   -5,    3,   20,   -1,   -3,  -45,    5,  -21,  -45,    8,
         22,   23,  -28,   10,   27,    1,   23,  -15,   -4,   15,   26,
        -31,   30,  109,   32,   38,   34,   11,  -20,  -18,  -45,  -46,
        -29,   10,   11,   11,  -13,    2,   -9,   32,  -45,   49,   -3,
         -8,   22,   20,   28,   28,    6,    7,  -20,   23,   10,   33,
        -14,   28,    8,   47,  -22,  -23,    1,   26,  -47,    1,    8,
         14,   23,   19,   18,    0,  -21,   44,   58,   14,   46,  -31,
         21,  -26,   16,   -1,  -10,  -43,  -23,    7,   35,   13,   19,
        112,  -25,   12,   -1,   -9,   -6,  -40,   21,   15,   16,  -33,
        -16,    7,   -7,    6,  -10,   14,  -54,   26,    7,  -29,   -1,
        -34,   27,  -46,    9,   12,  -23,   22,   37,  -49,  -25,  -32,
         33,   31,   -3,  -10,    8,   -5,   11,    9,  -28,  -45,  -20,
         14,   18,   -9,   -1,  119, -100,   37,  -26,  -21,   63,  -24,
          3,    2,  -26,  -51,   -2,  -14,   -7,   32,    8,    9,   -2,
        -28,  -15,  -21,   13,  -18,  -23,   29,    8,  -72,   -9,  -31,
         17,  -29,   16,   21,   56,   18,  -28,   45,   21,    0,   30,
         -4,  -13,    4,   14,   -8,   27,    3,   -2,   17,   40,  -37,
         24,   20,  -54,   11,  -23,   -1,   -1,    8,  -19,   -4,   -8,
          1,    5,  -49,   14,   21,   -8,   -8,   18,  -31,    4,    9,
         -5,  -41,    8,  -43,  -31,  -17,  -17,  -12,   -2,  -18,  -15,
         -3,    4,   53,  -12,  -14,    1,   38,   -9,   16,  -35,   10,
        -21,   37,  -42,   54,   33,  -21,  -19,   -1,  -79,   27,  -10,
         20,  -18,  -10,   19,   35,  -11,   42,    1,    9,  -23,  -40,
         27,   -5,  -52,    8,  -48,   15,    5,   -8,   48,    1,   -4,
        -25,   34,   -6,  -20,  -23,   10,  -26,  -24,   18,   22,    7,
         -6,  -25,  -26,  -11,   -2,   -1,   -9,  -69,  -43,  -35,   36,
         85,   48,  -20,   23,   -5,  -22,  -12,    5,  -10,  -25,   55,
        -16,   -5,    8,  -11,   38,   36,   -4,   29,    4,   49,   -3,
         45,   23,    1,   11,  -25,   41,    3,   44,   39,   -9,   -2,
        -21,    4,    3,   10,   14,   -7,   60,   24,   26,   -9,  -79,
        -17,  -15,   43,   46,  -16,  -40,   -7,   34,    5,   -2,   -4,
        -16,    7,  -33,  -26,  -18,  -10,  -63,   27,  -46,   -9,    8,
          3,  -46,  -15,    6,   35,  -27,   -8,   -8,   26,   23,   -9,
        -52,   14,  -26,  -11,   21,  -11,  -14,   -8,  -10,  -31,   90,
         -8,   35,    4,   54,   45,   -2,   44,   46,  -26,  -18,  -29,
         13,  -22,   26,  -11,    1,   -3,   -1,   33,  -13,  -30,   -3,
         56,   17,   49,  -65,   18,   16,   -4,  -33,   39,   56,    2,
         -3,    6,   58,  -51,   38,  -23,  -32,   -3,  -32,  -17,    9,
        -16,   -2,   31,   12,   29,  -34,   35,  -30,   82,  -17,   -8,
        -46,    1,    0,  -25,   -4,   18,    1,   11,   21,    9,  -30,
          1,    7,   -4,  -14,   16,   27,   47,  -22,   18,   30,   11,
         -7,  -16,    0,   -4,   46,   27,  -12,    3,   28,   18,   17,
        -50,  -24,   14,  -32,   33,   12,   23,  -61,   29,   -5,   54,
         16,   -8,  -26,   18,  -54,   26,   -7,    0,   16,   -4,    0,
        -51,   -8,   36,  -16,   14,   26,  -20,   -3,   64,  -62,  -68,
         -2,   -5,  -14,    2,    8,   22,  -52,   -5,   18,   -5,  -18,
         32,  -32,   35,   -2,  -11,   40,  -17,    1,  -31,  -20,    4,
         10,   31,  -40,   16,   -6,  -49,  -30,   38,   25,    3,   -2,
          4,   16,   56,   -1,   28,  -70,   49,   -7,  -39,  -42,    4,
        -37,   61,   47,   21,   35,   12,   -2,   -1,    7,  -38,  -26,
         21,   36,   21,   -6,   60,  -28,   20,  -19,   55,   -7,   11,
        -35,  -37,  -27,  -15,   13,   24,  -48,  -13,   42,   15,   -8,
          4,   23,   17,  -18,   -2,    6,  -34,   15,   10,   15,    3,
        -30,   70,  -74,   29,   20,  -10,   66,   17,  -13,  -16,  -19,
         -8,    3,   63,  -21,   -9,  -17,  -63,   18,   20,   12,   36,
         17,   28,   32,   55,   -3,  -13,   41,    0,   31,  -20,   32,
        -98,   36,  -54,   13,  -44,   -8,   84,  -47,    6,   25,  -19,
        -23,   -3,   28,   -3,   14,   -7,   90,   -6,  -11,   14,   17,
         83,   51,   51,  -11,    2,  -33,  -23,   22,   -3,  -17,  -18,
         -1,  -25,   10,   10,  -13,   51,  -55,    2,  -14,   16,   -8,
         -2,  -14,   28,   -4,  -64,   48,  -17,   31,  -19,  -52,  -17,
        -24,   53,    7,   50,  -17,   -3,  -25,  -12,   10,   49,   18,
         54,   14,  -21,  -17,   14,   28,   24,   -7,   13,    7,   -6,
        -14,  -25,   -2,  -19,   10,   -8,  -21,   51,    7,   47,  -14,
          8,    0,    4,   31,   18,  -16,   24,   15,   61,  -28,    3,
         -7,   24,  -33,   13,  -11,    1,  -22,   42,   16,  -13,   34,
         15,  -29,  -46,   21,   32,    7,   -8,   31,  103,   11,  -32,
          5,    5,  -13,   -7,  101,  -16,    3,    4,   11,    7,  -11,
         45,   -7,   41,   -1,  -12,  -14,   19,  -44,   65,   -2,  -50,
         -4,   43,   46,  -11,  -12,    4,  -25,   44,  -90,   31,   -5,
        -56,   -3,    9,    6,   35,   -4,   99,  -29,   84,   45,   15,
        -37,  -19,  -13,   34,  -17,  -43,   -4,  -17,  -63,    8,  -27,
         22,   43,  -19,   45,    2,  -69,    7,  -21,   -4,  -10,  -17,
        -19,   17,  -34,   25,    9,  -26,  -13,   46,  -21,   43,   -9,
         15,  -33,   61,   -7,   10,   12,   15,   -2,   18,  -10,   -6,
        -12,  -20,   41,   14,    9,   39,   14,   -5,   -3,  -35,  -18,
         10,    4,   28,   -8,   40,   60,   33,  -26,  -36,   22,   28,
        -16,   -5,  -51,   -4,   30,   19,   41,  -57,  -20,  -63,   53,
         27,   -2,   17,   22,   -1,   12,   -1,  -34,  -30,  -17,  -64,
        -40,   -7,    8,    6,    1,  -47,   42,   39,   36,  -67,   24,
         30,   26,   41,  -11,    8,   -2,   65,   33,  -44,   78,  -16,
          2,   -3,   33,  -32,  -64,   24,   -4,  -28,   23,    4,    8,
         17,  -41,   -4,    5,  -44,    0,   39,   19,  -26,    3,  -17,
         -8,  -18,    2,    2,   35,  -15,    2,   -2,    4,    3,   10,
          4,  -28,  -65,   12,   42,    0,   29,  -24,   36,   60,  -15,
         33,  -58,  -59,    9,   -1,   15,  -22,   30,   35,   -5,   -2,
        -19,   -9,  -15,    3,    4,  -71,  -11,  -48,   49,  -22,   32,
        -36,    6,    5,   -7,   15,    2,   13,   -2,   13,   29,  -10,
         34,  -49,  -18,  -32,   -2,    4,   12,    5,  -27,  -24,   -7,
         20,   18,   22,    7,   -2,   -5,  -59,   -5,   27,  -23,   50,
         -5,   -5,   -3,   -9,  -33,  -23,    6,    9,   26,  -36,  -48,
        -69,  -19,    4,   35,  -16,    7,   -3,  -49,  -16,   18,   -8,
         -4,  -47,    7,   -5,   -8,  -40,   38,   54,  -12,  -36,    5,
         14,    2,   12,  -23,    4,  -15,  -33,   14,   25,   14,   25,
         33,    1,   65,   -1,  -11,   29,   -6,   38,  -16,   -1,   -6,
         -8,   12,   17,   48,   23,  -35,   27,   32,  -26,   55,  -43,
        -27,  -18,   17,   -3,   11,   30,   42,  -11,  -57,   15,   39,
         19,  -19,   38,   60,   18,   -3,   18,  -20,   11,   12,   41,
        -16,   11,  -46,  -64,   29,    0,   19,    9,   29,   26,   -9,
        -19,   33,   21,  -24,  -45,    1,  -22,   11,  -29,  -57,  -39,
         -2,   -3,   14,   21,   27,   26,   14,    1,   11,   -9,  -25,
         -9,    9,    9,  -39,    0,   23,    1,   -2,  -10,  -31,   41,
        -19,    6,    3,    9,   16,    5,  -30,   12,   78,  -30,   15,
          3,   -6,   40,   34,  -15,  -30,    1,  -10,  -46,  -32,  -62,
         -6,   51,   20,   50,  -32,   10,   -8,  -37,   16,  -13,   11,
         -1,   22,   42,  -44,  -11,  -24,  -16,  -39,  -69,  -17,   30,
         12,  -20,  -37,   33,  -16,  -13,  -23,   26,   24,   -6,   73,
        -42,  -21,  -24,   -8,   39,   -9,  -25,   39,  -28,  -29,  -16,
        -13,   34,   37,   52,    9,   25,  -17,  -58,  -25,    2,  -69,
        -30,   19,  -11,   14,  -46,   -9,  -36,  -46,   67,    7,   -5,
          9,    7,  -11,  -32,   17,   10,  -18,    1,  -19,   12,  -45,
         39,  -12,  -10,   -4,   10,   43,  -19,  -26,   24,    0,  -33,
         -4,    7,   23,  -26,   14,  -32,   11,   -6,   18,   -8,  -20,
         10,   17,  -14,   13,  -15,  -10,    5,   -2,   30,   33,  -37,
         -5,  -18,  -20,    4,   11,  -13,  -18,   10,   38,  -40,   -7,
          8,   -1,  -13,    6,    4,  -18,   33,   21,    0,  -49,   -9,
          7,  -26,   -5,  -34,  -19,  -37,    7,  -27,   -3,  -27,    0,
        -42,   13,   12,  -31,   32,  -36,   47,   14,   14,  -58,  -21,
          1,  -35,    9,   13,  -11,  -10,   11,  -14,    3,    2,  -37,
        -43,    5,   -5,  -16,  -19,   18,  -23,    0,  -20,  -15,   37,
        -25,  -13,  -22,  -53,  -17,   10,  -56,  -14,    0,   -3,   15,
        -54,   10,  -30,   11,  -14,   -4,  -35,  -26,   32,   33,  -11,
         34,  -35,   18,  -28,    2,  -42,  -21,   -6,  -39,   42,   -1,
         14,   26,   16,   21,   14,   40,    8,   24,    5,    8,  -36,
         30,  -28,  -16,   -3,   12,  -25,  -36,   27,  -20,   23,    6,
        -23,    4,    4,    3,   12,   11,   43,   18,  -53,   20,  -29,
         33,  -38,  -28,   -6,    0,    6,  -32,  -13,   -4,    0,   19,
         48,  -22,   26,   11,    7,  -13,  -14,   26,   16,   13,   -9,
         56,  -24,  -14,  -28,   -1,   13,   -3,  -16,   22,  -25,    2,
         21,   -7,   16,   -1,   26,  -38,  -11,   12,   15,  -72,   38,
        -36,  -26,   20,    2,    8,   36,  -49,  -55,   31,  -11,  -31,
         -9,    8,   40,  -25,   31,  -26,   22,   16,  -18,   34,    9,
        -16,  -10,    3,   26,  -20,  -44,  -37,  -35,   -2,  -16,  -65,
          2,  -38,   21,  -12,   20,  -12,   18,   -4,   -9,  -36,  -11,
        -54,   21,  -23,   63,   18,  -19,   28,   10,   16,    8,   27,
        -33,   16,  -15,   13,  -10,  -24,  -32,   22,    9,  -41,   15,
          8,   10,   58,  -27,  -26,   -1,   46,    5,  -47,  -49,   -4,
          3,   16,  -64,   27,  -62,   18,   35,  -15,   35,   43,  -24,
         48,   -5,   35,  -21,  -39,  -30,  -68,  -54,   -9,  -30,  -25,
         62,   42,   50,  -11,    3,  -38,   32,  -56,  -24,  -27,   30,
        -69,    2,   24,  -15,   44,   23,   -9,   53, -109, -112,   -8,
          7,   14,  -10,  -23,  -51,  -14,   79,   48,  -23,   48,   63,
         45,   11,   -6,   13,    2,    5,    9,   22,    1,  -87,  -20,
         29,   38,    5,   78,    1,  -19,   -6,   26,  -29,  -12,    8,
        -64,   38,   12,   -4,  -54,  -50,   -4,   27,   16,   10,   -1,
        -46,    4,  -13,    0,  -35,  -32,  -14,   36,   37,   -5,   29,
        -44,  -33,   25,  -26,  -29,   20,    1,  -61,   25,   32,   34,
         40,   -4,   18,  -42,   14,  -22,   28,   10,  -38,   -9,   10,
         45,   31,  -10,  -27,  -32,  -42,   18,   21,  -47,   40,  -30,
         -3,    6,   56,  -11,   18,  -51,  -37,   52,  -10,    9,  -18,
        -15,    8,   -8,  -27,   10,   -2,  -26,    4,   27,   -5,  -12,
         54,  -11,    9,   45,   79,  -69,   36,  -39,  -68,   12,    0,
         16,  -47,  -14,   17,   13,  -71,   55,   -7,   53,  -18,  -11,
         -2,   -3,  -33,  -29,  -44,  -26,   16,   17,  -33,  -20,   61,
         14,   89,    9,  -34,  -31,  -59,   38,  -27,   39,  -47,    2,
        -45,   -7,   16,  -11,   49,   43,    2,  -26,   43,   24,    1,
         18,  -55,   62,    7,  107,  -20,   -6,   21,   39,  -15,    3,
        -31,  -51,    4,   -6,   49,   23,   24,   56,   -4,   20,  -20,
         12,  -23,  -46,   21,   15,  -36,  -42,   14,   84,  -15,   40,
         16,  -17,    2,   -3,    6,  -35,   70,  -34,  -40,   -9,   11,
        -36,   17,    3,   14,   22,   15,   56,   -9,  -33,  -36,   -8,
         40,   25,   -4,    9,  -59,  -12,   18,   59,   -4,   17,   19,
         68,    1,    7,   12,  -30,   10,   15,   -4,   32,    2,  -17,
